[Survived] OptionalChaining
src/middlewares/verifyUserLoginStatus.middleware.js:7:23
 import jwt from "jsonwebtoken";
 const verifyUserLoginStatus = async (req, res, next) => {
     try {
-        const token = req.cookies?.token;
+        const token = req.cookies.token;
         
         let { email } = req.body;

[Killed] ObjectLiteral
src/middlewares/verifyUserLoginStatus.middleware.js:55:37
     }
     catch (error) {
         console.error(error);
-        return res.status(500).json({ success: false, message: "error while verifying user login status" });
+        return res.status(500).json({});
     }
 };
killedBy: verifyUserLoginStatus Middleware Middleware throws error → 500
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "error while verifying user login status",
-   "success": false,
