[Killed] BlockStatement
src/controllers/Portfolio/portfolioFundamentals.controller.js:5:28
 const yahooFinance = new YahooFinance()
 import { getStockSummary } from "../../db/stockSummary.js";
 
-function formatNumber(num) {
-  if (!num && num !== 0) return "--";
-  if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
-  if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
-  if (num >= 1e6) return (num / 1e6).toFixed(2) + "M";
-  return num.toFixed(2);
-}
+function formatNumber(num) {}
 
 export const getPortfolioFundamentals = async (req, res) => {
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,37 +1,37 @@
  Object {
    "count": 2,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:6:15
 import { getStockSummary } from "../../db/stockSummary.js";
 
 function formatNumber(num) {
-  if (!num && num !== 0) return "--";
+  if (!num && num === 0) return "--";
   if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
   if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully and empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:6:7
 import { getStockSummary } from "../../db/stockSummary.js";
 
 function formatNumber(num) {
-  if (!num && num !== 0) return "--";
+  if (!num || num !== 0) return "--";
   if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
   if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,37 +1,37 @@
  Object {
    "count": 2,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:7:7
 
 function formatNumber(num) {
   if (!num && num !== 0) return "--";
-  if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
+  if (false) return (num / 1e12).toFixed(2) + "T";
   if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
   if (num >= 1e6) return (num / 1e6).toFixed(2) + "M";
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -10,11 +10,11 @@
        "exDivDate": "--",
        "forwardAnnualDivRate": "--",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:7:7
 
 function formatNumber(num) {
   if (!num && num !== 0) return "--";
-  if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
+  if (true) return (num / 1e12).toFixed(2) + "T";
   if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
   if (num >= 1e6) return (num / 1e6).toFixed(2) + "M";
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,36 +1,36 @@
  Object {
    "count": 2,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:8:7
 function formatNumber(num) {
   if (!num && num !== 0) return "--";
   if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
-  if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
+  if (num < 1e9) return (num / 1e9).toFixed(2) + "B";
   if (num >= 1e6) return (num / 1e6).toFixed(2) + "M";
   return num.toFixed(2);
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,36 +1,36 @@
  Object {
    "count": 2,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:8:7
 function formatNumber(num) {
   if (!num && num !== 0) return "--";
   if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
-  if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
+  if (num > 1e9) return (num / 1e9).toFixed(2) + "B";
   if (num >= 1e6) return (num / 1e6).toFixed(2) + "M";
   return num.toFixed(2);
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Additional formatNumber branch coverage via controller should format numbers into T, B, M, --, and fixed decimals
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.00B"
Received: "1000.00M"

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:9:7
   if (!num && num !== 0) return "--";
   if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
   if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
-  if (num >= 1e6) return (num / 1e6).toFixed(2) + "M";
+  if (num < 1e6) return (num / 1e6).toFixed(2) + "M";
   return num.toFixed(2);
 }
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,36 +1,36 @@
  Object {
    "count": 2,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:9:7
   if (!num && num !== 0) return "--";
   if (num >= 1e12) return (num / 1e12).toFixed(2) + "T";
   if (num >= 1e9) return (num / 1e9).toFixed(2) + "B";
-  if (num >= 1e6) return (num / 1e6).toFixed(2) + "M";
+  if (false) return (num / 1e6).toFixed(2) + "M";
   return num.toFixed(2);
 }
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "count": 2,

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioFundamentals.controller.js:16:9
 export const getPortfolioFundamentals = async (req, res) => {
   try {
     const {email} = req.user;
-    if (!email) {
+    if (email) {
       return res.status(400).json({ success: false, message: "Email required" });
     }
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] BlockStatement
src/controllers/Portfolio/portfolioFundamentals.controller.js:16:17
 export const getPortfolioFundamentals = async (req, res) => {
   try {
     const {email} = req.user;
-    if (!email) {
-      return res.status(400).json({ success: false, message: "Email required" });
-    }
+    if (!email) {}
 
     const portfolio = await getStockSummary(email); 
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Edge Cases should return 400 if email is not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioFundamentals.controller.js:17:46
   try {
     const {email} = req.user;
     if (!email) {
-      return res.status(400).json({ success: false, message: "Email required" });
+      return res.status(400).json({ success: true, message: "Email required" });
     }
 
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Edge Cases should return 400 if email is not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Email required",
-   "success": false,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:21:23
     }
 
     const portfolio = await getStockSummary(email); 
-    if (!portfolio || portfolio.length === 0) {
+    if (!portfolio || portfolio.length !== 0) {
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:21:9
     }
 
     const portfolio = await getStockSummary(email); 
-    if (!portfolio || portfolio.length === 0) {
+    if (!portfolio && portfolio.length === 0) {
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Edge Cases should return 404 if no holdings are found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioFundamentals.controller.js:22:46
 
     const portfolio = await getStockSummary(email); 
     if (!portfolio || portfolio.length === 0) {
-      return res.status(404).json({ success: false, message: "No holdings found" });
+      return res.status(404).json({ success: true, message: "No holdings found" });
     }
 
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Edge Cases should return 404 if no holdings are found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "No holdings found",
-   "success": false,

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioFundamentals.controller.js:25:35
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
 
-    const symbols = portfolio.map(stock => stock.symbol);
+    const symbols = portfolio.map(() => undefined);
 
     const results = await Promise.allSettled(
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AAPL", {"modules": ["price", "summaryDetail", "defaultKeyStatistics", "calendarEvents"]}
Received
       1
          undefined,
          {"modules": ["price", "summaryDetail", "defaultKeyStatistics", "calendarEvents"]},
       2

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioFundamentals.controller.js:28:19
     const symbols = portfolio.map(stock => stock.symbol);
 
     const results = await Promise.allSettled(
-      symbols.map(symbol =>
-        yahooFinance.quoteSummary(symbol, {
-          modules: ["price", "summaryDetail", "defaultKeyStatistics", "calendarEvents"]
-        })
+      symbols.map(() => undefined
       )
     );
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:37:11
 
     const data = results.map((res, i) => {
       const symbol = symbols[i];
-      if (res.status !== "fulfilled") {
+      if (false) {
         console.warn(`Failed to fetch ${symbol}`, res.reason?.message);
         return {
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Edge Cases should handle YahooFinance API failure gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:37:11
 
     const data = results.map((res, i) => {
       const symbol = symbols[i];
-      if (res.status !== "fulfilled") {
+      if (true) {
         console.warn(`Failed to fetch ${symbol}`, res.reason?.message);
         return {
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 2,
    "data": Array [

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:46:21
       }
 
       const result = res.value;
-      const price = result.price || {};
+      const price = result.price && {};
       const summary = result.summaryDetail || {};
       const stats = result.defaultKeyStatistics || {};
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully and empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:46:21
       }
 
       const result = res.value;
-      const price = result.price || {};
+      const price = true;
       const summary = result.summaryDetail || {};
       const stats = result.defaultKeyStatistics || {};
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -9,12 +9,12 @@
        "epsEstimateNextYear": 5,
        "exDivDate": "--",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:47:23
 
       const result = res.value;
       const price = result.price || {};
-      const summary = result.summaryDetail || {};
+      const summary = true;
       const stats = result.defaultKeyStatistics || {};
       const calendar = result.calendarEvents || {};
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "count": 2,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:47:23
 
       const result = res.value;
       const price = result.price || {};
-      const summary = result.summaryDetail || {};
+      const summary = false;
       const stats = result.defaultKeyStatistics || {};
       const calendar = result.calendarEvents || {};
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "count": 2,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:48:21
       const result = res.value;
       const price = result.price || {};
       const summary = result.summaryDetail || {};
-      const stats = result.defaultKeyStatistics || {};
+      const stats = result.defaultKeyStatistics && {};
       const calendar = result.calendarEvents || {};
 
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully and empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:48:21
       const result = res.value;
       const price = result.price || {};
       const summary = result.summaryDetail || {};
-      const stats = result.defaultKeyStatistics || {};
+      const stats = false;
       const calendar = result.calendarEvents || {};
 
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,15 +4,15 @@
      Object {
        "avgVolume3M": "1.00M",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:49:24
       const price = result.price || {};
       const summary = result.summaryDetail || {};
       const stats = result.defaultKeyStatistics || {};
-      const calendar = result.calendarEvents || {};
+      const calendar = false;
 
       return {
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,11 +2,11 @@
    "count": 2,
    "data": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:49:24
       const price = result.price || {};
       const summary = result.summaryDetail || {};
       const stats = result.defaultKeyStatistics || {};
-      const calendar = result.calendarEvents || {};
+      const calendar = true;
 
       return {
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,11 +2,11 @@
    "count": 2,
    "data": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:52:17
       const calendar = result.calendarEvents || {};
 
       return {
-        symbol: price.symbol || symbol,
+        symbol: true,
         lastPrice: formatNumber(price.regularMarketPrice),
         marketCap: formatNumber(price.marketCap),
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -12,11 +12,11 @@
        "forwardAnnualDivYield": "--",
        "forwardPE": 30,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:52:17
       const calendar = result.calendarEvents || {};
 
       return {
-        symbol: price.symbol || symbol,
+        symbol: false,
         lastPrice: formatNumber(price.regularMarketPrice),
         marketCap: formatNumber(price.marketCap),
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -12,11 +12,11 @@
        "forwardAnnualDivYield": "--",
        "forwardPE": 30,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:56:30
         lastPrice: formatNumber(price.regularMarketPrice),
         marketCap: formatNumber(price.marketCap),
         avgVolume3M: formatNumber(summary.averageVolume3Month),
-        epsEstimateNextYear: stats.forwardEps ?? "--",
+        epsEstimateNextYear: stats.forwardEps && "--",
         forwardPE: stats.forwardPE ?? "--",
         divPaymentDate: calendar.dividendDate ?? "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
      Object {
        "avgVolume3M": "1.00M",

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:57:20
         marketCap: formatNumber(price.marketCap),
         avgVolume3M: formatNumber(summary.averageVolume3Month),
         epsEstimateNextYear: stats.forwardEps ?? "--",
-        forwardPE: stats.forwardPE ?? "--",
+        forwardPE: stats.forwardPE && "--",
         divPaymentDate: calendar.dividendDate ?? "--",
         exDivDate: summary.exDividendDate ?? "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,11 +8,11 @@
        "dividendPerShare": "--",
        "epsEstimateNextYear": 5,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:58:25
         avgVolume3M: formatNumber(summary.averageVolume3Month),
         epsEstimateNextYear: stats.forwardEps ?? "--",
         forwardPE: stats.forwardPE ?? "--",
-        divPaymentDate: calendar.dividendDate ?? "--",
+        divPaymentDate: calendar.dividendDate && "--",
         exDivDate: summary.exDividendDate ?? "--",
         dividendPerShare: summary.dividendRate ?? "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,11 +2,11 @@
    "count": 2,
    "data": Array [

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:59:20
         epsEstimateNextYear: stats.forwardEps ?? "--",
         forwardPE: stats.forwardPE ?? "--",
         divPaymentDate: calendar.dividendDate ?? "--",
-        exDivDate: summary.exDividendDate ?? "--",
+        exDivDate: summary.exDividendDate && "--",
         dividendPerShare: summary.dividendRate ?? "--",
         forwardAnnualDivRate: summary.dividendRate ?? "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,11 +5,11 @@
        "avgVolume3M": "1.00M",
        "currentHolding": 10,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:60:27
         forwardPE: stats.forwardPE ?? "--",
         divPaymentDate: calendar.dividendDate ?? "--",
         exDivDate: summary.exDividendDate ?? "--",
-        dividendPerShare: summary.dividendRate ?? "--",
+        dividendPerShare: summary.dividendRate && "--",
         forwardAnnualDivRate: summary.dividendRate ?? "--",
         forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,11 +3,11 @@
    "data": Array [
      Object {

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:61:31
         divPaymentDate: calendar.dividendDate ?? "--",
         exDivDate: summary.exDividendDate ?? "--",
         dividendPerShare: summary.dividendRate ?? "--",
-        forwardAnnualDivRate: summary.dividendRate ?? "--",
+        forwardAnnualDivRate: summary.dividendRate && "--",
         forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ?? "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,11 +6,11 @@
        "currentHolding": 10,
        "divPaymentDate": "2023-12-01",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:62:57
         exDivDate: summary.exDividendDate ?? "--",
         dividendPerShare: summary.dividendRate ?? "--",
         forwardAnnualDivRate: summary.dividendRate ?? "--",
-        forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
+        forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield / 100).toFixed(2) + "%" : "--",
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ?? "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -24,11 +24,11 @@
        "divPaymentDate": "2023-11-01",
        "dividendPerShare": "--",

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:63:32
         dividendPerShare: summary.dividendRate ?? "--",
         forwardAnnualDivRate: summary.dividendRate ?? "--",
         forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
-        trailingAnnualDivRate: summary.trailingAnnualDividendRate ?? "--",
+        trailingAnnualDivRate: summary.trailingAnnualDividendRate && "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
         priceToBook: stats.priceToBook ?? "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -13,11 +13,11 @@
        "forwardPE": 30,
        "lastPrice": "0.00",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:64:72
         forwardAnnualDivRate: summary.dividendRate ?? "--",
         forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ?? "--",
-        trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
+        trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield / 100).toFixed(2) + "%" : "--",
         priceToBook: stats.priceToBook ?? "--",
         currentHolding: portfolio.find(p => p.symbol === symbol)?.current_holding ?? 0
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -31,10 +31,10 @@
        "lastPrice": "2800.00",
        "marketCap": "1.00T",

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:65:22
         forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ?? "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
-        priceToBook: stats.priceToBook ?? "--",
+        priceToBook: stats.priceToBook && "--",
         currentHolding: portfolio.find(p => p.symbol === symbol)?.current_holding ?? 0
       };
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -11,11 +11,11 @@
        "forwardAnnualDivRate": "--",
        "forwardAnnualDivYield": "--",

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioFundamentals.controller.js:66:40
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ?? "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
         priceToBook: stats.priceToBook ?? "--",
-        currentHolding: portfolio.find(p => p.symbol === symbol)?.current_holding ?? 0
+        currentHolding: portfolio.find(() => undefined)?.current_holding ?? 0
       };
     });
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,11 @@
  Object {
    "count": 2,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:66:45
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ?? "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
         priceToBook: stats.priceToBook ?? "--",
-        currentHolding: portfolio.find(p => p.symbol === symbol)?.current_holding ?? 0
+        currentHolding: portfolio.find(p => p.symbol !== symbol)?.current_holding ?? 0
       };
     });
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,11 @@
  Object {
    "count": 2,
