[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioFundamentals.controller.js:70:37
       };
     });
 
-    res.status(200).json({ success: true, count: data.length, data });
+    res.status(200).json({ success: false, count: data.length, data });
   } catch (error) {
     console.error("Error fetching portfolio financial details:", error);
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 2,
-   "data": Any<Array>,

[Killed] BlockStatement
src/controllers/Portfolio/portfolioFundamentals.controller.js:71:19
     });
 
     res.status(200).json({ success: true, count: data.length, data });
-  } catch (error) {
-    console.error("Error fetching portfolio financial details:", error);
-    res.status(500).json({
-      success: false,
-      message: "Failed to fetch portfolio financial details"
-    });
-  }
+  } catch (error) {}
 };
 
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Edge Cases should handle unexpected errors gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
