[Killed] BlockStatement
src/controllers/Portfolio/portfolioHolding.controller.js:5:28
 import { getPrice } from "../../utils/getQuotes.js";
 
 
-function formatNumber(num) {
-  if (!num && num !== 0) return "--";
-  return Number(num).toLocaleString("en-IN", {
-    minimumFractionDigits: 2,
-    maximumFractionDigits: 2,
-  });
-}
+function formatNumber(num) {}
 
 export const getPortfolioHoldings = async (req, res) => {
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 1,
    "data": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioHolding.controller.js:6:7
 
 
 function formatNumber(num) {
-  if (!num && num !== 0) return "--";
+  if (true) return "--";
   return Number(num).toLocaleString("en-IN", {
     minimumFractionDigits: 2,
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 1,
    "data": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioHolding.controller.js:6:15
 
 
 function formatNumber(num) {
-  if (!num && num !== 0) return "--";
+  if (!num && true) return "--";
   return Number(num).toLocaleString("en-IN", {
     minimumFractionDigits: 2,
killedBy: getPortfolioHoldings Controller should format null/undefined as '--'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,18 +4,18 @@
      Object {
        "avgPrice": "--",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioHolding.controller.js:15:19
 
 export const getPortfolioHoldings = async (req, res) => {
   try {
-    const email = req.user?.email || req.query.email;
+    const email = false;
     if (!email) {
       return res.status(400).json({ success: false, message: "Email required" });
killedBy: getPortfolioHoldings Controller should return 404 when no holdings exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 400

Number of calls: 1

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioHolding.controller.js:15:19
 
 export const getPortfolioHoldings = async (req, res) => {
   try {
-    const email = req.user?.email || req.query.email;
+    const email = req.user?.email && req.query.email;
     if (!email) {
       return res.status(400).json({ success: false, message: "Email required" });
killedBy: getPortfolioHoldings Controller should return 404 when no holdings exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioHolding.controller.js:16:9
 export const getPortfolioHoldings = async (req, res) => {
   try {
     const email = req.user?.email || req.query.email;
-    if (!email) {
+    if (false) {
       return res.status(400).json({ success: false, message: "Email required" });
     }
killedBy: getPortfolioHoldings Controller should return 400 when email is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioHolding.controller.js:16:9
 export const getPortfolioHoldings = async (req, res) => {
   try {
     const email = req.user?.email || req.query.email;
-    if (!email) {
+    if (email) {
       return res.status(400).json({ success: false, message: "Email required" });
     }
killedBy: getPortfolioHoldings Controller should return 400 when email is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BlockStatement
src/controllers/Portfolio/portfolioHolding.controller.js:21:47
     }
 
     const portfolio = await getStockSummary(email);
-    if (!portfolio || portfolio.length === 0) {
-      return res.status(404).json({ success: false, message: "No holdings found" });
-    }
+    if (!portfolio || portfolio.length === 0) {}
 
     const results = await Promise.allSettled(
killedBy: getPortfolioHoldings Controller should return 404 when no holdings exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioHolding.controller.js:21:9
     }
 
     const portfolio = await getStockSummary(email);
-    if (!portfolio || portfolio.length === 0) {
+    if (portfolio || portfolio.length === 0) {
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
killedBy: getPortfolioHoldings Controller should return fallback values when getPrice fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioHolding.controller.js:26:21
     }
 
     const results = await Promise.allSettled(
-      portfolio.map(stock =>
-        getPrice(stock.symbol)
+      portfolio.map(() => undefined
       )
     );
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 1,
    "data": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioHolding.controller.js:32:11
     );
     const holdings = results.map((res, i) => {
       const stock = portfolio[i];
-      if (res.status !== "fulfilled" || !res.value) {
+      if (true) {
         return {
           symbol: stock.symbol,
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 1,
    "data": Array [

[Killed] BlockStatement
src/controllers/Portfolio/portfolioHolding.controller.js:32:53
     );
     const holdings = results.map((res, i) => {
       const stock = portfolio[i];
-      if (res.status !== "fulfilled" || !res.value) {
-        return {
-          symbol: stock.symbol,
-          status: "Open",
-          shares: stock.current_holding,
-          lastPrice: "--",
-          avgPrice: stock.avg_price,
-          totalCost: "--",
-          marketValue: "--",
-          totalDivIncome: "--",
-          dayGainPercent: "--",
-          dayGainValue: "--",
-          totalGainPercent: "--",
-          totalGainValue: "--",
-          realizedGain: stock.realized_gain,
-        };
-      }
+      if (res.status !== "fulfilled" || !res.value) {}
 
       const p = res.value;
killedBy: getPortfolioHoldings Controller should return fallback values when getPrice fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioHolding.controller.js:57:25
       const avgPrice = stock.avg_price;
       const realizedGain = stock.realized_gain;
       const status = p.marketstate;
-      const totalCost = avgPrice * qty;
+      const totalCost = avgPrice / qty;
       const marketValue = lastPrice * qty;
       const totalUnrealizedGain = marketValue - totalCost;
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -9,13 +9,13 @@
        "marketValue": "1,500.00",
        "realizedGain": "25.00",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioHolding.controller.js:58:27
       const realizedGain = stock.realized_gain;
       const status = p.marketstate;
       const totalCost = avgPrice * qty;
-      const marketValue = lastPrice * qty;
+      const marketValue = lastPrice / qty;
       const totalUnrealizedGain = marketValue - totalCost;
       const totalUnrealizedGainPercent =
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,18 +4,18 @@
      Object {
        "avgPrice": "100.00",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioHolding.controller.js:59:35
       const status = p.marketstate;
       const totalCost = avgPrice * qty;
       const marketValue = lastPrice * qty;
-      const totalUnrealizedGain = marketValue - totalCost;
+      const totalUnrealizedGain = marketValue + totalCost;
       const totalUnrealizedGainPercent =
         totalCost > 0 ? (totalUnrealizedGain / totalCost) * 100 : 0;
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -11,11 +11,11 @@
        "shares": 10,
        "status": "REGULAR",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioHolding.controller.js:61:25
       const marketValue = lastPrice * qty;
       const totalUnrealizedGain = marketValue - totalCost;
       const totalUnrealizedGainPercent =
-        totalCost > 0 ? (totalUnrealizedGain / totalCost) * 100 : 0;
+        totalCost > 0 ? totalUnrealizedGain / totalCost / 100 : 0;
 
       const dayGainValue = (lastPrice - prevClose) * qty;
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -11,11 +11,11 @@
        "shares": 10,
        "status": "REGULAR",

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioHolding.controller.js:61:9
       const marketValue = lastPrice * qty;
       const totalUnrealizedGain = marketValue - totalCost;
       const totalUnrealizedGainPercent =
-        totalCost > 0 ? (totalUnrealizedGain / totalCost) * 100 : 0;
+        totalCost <= 0 ? (totalUnrealizedGain / totalCost) * 100 : 0;
 
       const dayGainValue = (lastPrice - prevClose) * qty;
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -11,11 +11,11 @@
        "shares": 10,
        "status": "REGULAR",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioHolding.controller.js:63:28
       const totalUnrealizedGainPercent =
         totalCost > 0 ? (totalUnrealizedGain / totalCost) * 100 : 0;
 
-      const dayGainValue = (lastPrice - prevClose) * qty;
+      const dayGainValue = (lastPrice - prevClose) / qty;
       const dayGainPercent =
         prevClose > 0 ? ((lastPrice - prevClose) / prevClose) * 100 : 0;
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,11 +2,11 @@
    "count": 1,
    "data": Array [

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioHolding.controller.js:63:29
       const totalUnrealizedGainPercent =
         totalCost > 0 ? (totalUnrealizedGain / totalCost) * 100 : 0;
 
-      const dayGainValue = (lastPrice - prevClose) * qty;
+      const dayGainValue = (lastPrice + prevClose) * qty;
       const dayGainPercent =
         prevClose > 0 ? ((lastPrice - prevClose) / prevClose) * 100 : 0;
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,11 +2,11 @@
    "count": 1,
    "data": Array [

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioHolding.controller.js:65:9
 
       const dayGainValue = (lastPrice - prevClose) * qty;
       const dayGainPercent =
-        prevClose > 0 ? ((lastPrice - prevClose) / prevClose) * 100 : 0;
+        prevClose >= 0 ? ((lastPrice - prevClose) / prevClose) * 100 : 0;
 
       return {
killedBy: getPortfolioHoldings Controller should format null/undefined as '--'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,11 @@
  Object {
    "count": 1,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioHolding.controller.js:65:9
 
       const dayGainValue = (lastPrice - prevClose) * qty;
       const dayGainPercent =
-        prevClose > 0 ? ((lastPrice - prevClose) / prevClose) * 100 : 0;
+        prevClose <= 0 ? ((lastPrice - prevClose) / prevClose) * 100 : 0;
 
       return {
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,11 @@
  Object {
    "count": 1,

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioHolding.controller.js:84:37
       };
     });
 
-    res.status(200).json({ success: true, count: holdings.length, data: holdings });
+    res.status(200).json({ success: false, count: holdings.length, data: holdings });
   } catch (error) {
     console.error("Error fetching portfolio holdings:", error);
killedBy: getPortfolioHoldings Controller should return fallback values when getPrice fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -15,7 +15,7 @@
        "totalDivIncome": "--",
        "totalGainPercent": "--",

[Killed] BlockStatement
src/controllers/Portfolio/portfolioHolding.controller.js:85:19
     });
 
     res.status(200).json({ success: true, count: holdings.length, data: holdings });
-  } catch (error) {
-    console.error("Error fetching portfolio holdings:", error);
-    res.status(500).json({
-      success: false,
-      message: "Failed to fetch portfolio holdings",
-    });
-  }
+  } catch (error) {}
 };
 
killedBy: getPortfolioHoldings Controller should return 500 when exception occurs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
