[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:11:8
   try {
     const { email } = req.user;
     const userHoldings = await getStockSummary(email);
-    if(!userHoldings) return res.status(503).json({success: false,message: "Failed to fetch stock Summary"});
+    if(true) return res.status(503).json({success: false,message: "Failed to fetch stock Summary"});
     if (userHoldings.length === 0) return res.status(200).json({success: false,summary: []});
     const results = await Promise.allSettled(
killedBy: getSummaryTable returns 200 with empty summary when no holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 503

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:11:8
   try {
     const { email } = req.user;
     const userHoldings = await getStockSummary(email);
-    if(!userHoldings) return res.status(503).json({success: false,message: "Failed to fetch stock Summary"});
+    if(false) return res.status(503).json({success: false,message: "Failed to fetch stock Summary"});
     if (userHoldings.length === 0) return res.status(200).json({success: false,summary: []});
     const results = await Promise.allSettled(
killedBy: getSummaryTable returns 503 when stock summary is null (DB failure to fetch)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:12:9
     const { email } = req.user;
     const userHoldings = await getStockSummary(email);
     if(!userHoldings) return res.status(503).json({success: false,message: "Failed to fetch stock Summary"});
-    if (userHoldings.length === 0) return res.status(200).json({success: false,summary: []});
+    if (false) return res.status(200).json({success: false,summary: []});
     const results = await Promise.allSettled(
       userHoldings.map((holding) =>
killedBy: getSummaryTable returns 200 with empty summary when no holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": false,
+   "success": true,

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:12:74
     const { email } = req.user;
     const userHoldings = await getStockSummary(email);
     if(!userHoldings) return res.status(503).json({success: false,message: "Failed to fetch stock Summary"});
-    if (userHoldings.length === 0) return res.status(200).json({success: false,summary: []});
+    if (userHoldings.length === 0) return res.status(200).json({success: true,summary: []});
     const results = await Promise.allSettled(
       userHoldings.map((holding) =>
killedBy: getSummaryTable returns 200 with empty summary when no holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": false,
+   "success": true,

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioSummary.controller.js:14:24
     if(!userHoldings) return res.status(503).json({success: false,message: "Failed to fetch stock Summary"});
     if (userHoldings.length === 0) return res.status(200).json({success: false,summary: []});
     const results = await Promise.allSettled(
-      userHoldings.map((holding) =>
-        yahooFinance.quoteSummary(holding.symbol, {
-          modules: ["price", "summaryDetail", "defaultKeyStatistics"],
-        })
+      userHoldings.map(() => undefined
       )
     );
killedBy: getSummaryTable handles all rejected YahooFinance calls (filters all out)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:23:13
 
     const tableData = results
       .map((res, i) => {
-        if (res.status !== "fulfilled") return null;
+        if (false) return null;
         const currencychange = PriceStore.get(res.value.price.currency)||1;
         const price = res.value.price;
killedBy: getSummaryTable handles all rejected YahooFinance calls (filters all out)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:23:13
 
     const tableData = results
       .map((res, i) => {
-        if (res.status !== "fulfilled") return null;
+        if (res.status === "fulfilled") return null;
         const currencychange = PriceStore.get(res.value.price.currency)||1;
         const price = res.value.price;
killedBy: getSummaryTable handles all rejected YahooFinance calls (filters all out)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:24:32
     const tableData = results
       .map((res, i) => {
         if (res.status !== "fulfilled") return null;
-        const currencychange = PriceStore.get(res.value.price.currency)||1;
+        const currencychange = PriceStore.get(res.value.price.currency) && 1;
         const price = res.value.price;
         const lastPrice = price.regularMarketPrice/currencychange || 0;
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
-   "change": 0.0625,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:24:32
     const tableData = results
       .map((res, i) => {
         if (res.status !== "fulfilled") return null;
-        const currencychange = PriceStore.get(res.value.price.currency)||1;
+        const currencychange = false;
         const price = res.value.price;
         const lastPrice = price.regularMarketPrice/currencychange || 0;
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
-   "change": 0.0625,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:26:27
         if (res.status !== "fulfilled") return null;
         const currencychange = PriceStore.get(res.value.price.currency)||1;
         const price = res.value.price;
-        const lastPrice = price.regularMarketPrice/currencychange || 0;
+        const lastPrice = true;
         const previousClose = price.regularMarketPreviousClose/currencychange || 0;
         const change = price.regularMarketChange/currencychange || 0;
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,14 +5,14 @@
        "avgVolume": "-",
        "change": 0,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:26:27
         if (res.status !== "fulfilled") return null;
         const currencychange = PriceStore.get(res.value.price.currency)||1;
         const price = res.value.price;
-        const lastPrice = price.regularMarketPrice/currencychange || 0;
+        const lastPrice = price.regularMarketPrice / currencychange && 0;
         const previousClose = price.regularMarketPreviousClose/currencychange || 0;
         const change = price.regularMarketChange/currencychange || 0;
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
    "change": 0.0625,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:27:31
         const currencychange = PriceStore.get(res.value.price.currency)||1;
         const price = res.value.price;
         const lastPrice = price.regularMarketPrice/currencychange || 0;
-        const previousClose = price.regularMarketPreviousClose/currencychange || 0;
+        const previousClose = price.regularMarketPreviousClose / currencychange && 0;
         const change = price.regularMarketChange/currencychange || 0;
         const changePercent = price.regularMarketChangePercent || 0;
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
    "change": 0.0625,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:27:31
         const currencychange = PriceStore.get(res.value.price.currency)||1;
         const price = res.value.price;
         const lastPrice = price.regularMarketPrice/currencychange || 0;
-        const previousClose = price.regularMarketPreviousClose/currencychange || 0;
+        const previousClose = false;
         const change = price.regularMarketChange/currencychange || 0;
         const changePercent = price.regularMarketChangePercent || 0;
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  undefined,
  Object {
    "change": 0,

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioSummary.controller.js:28:24
         const price = res.value.price;
         const lastPrice = price.regularMarketPrice/currencychange || 0;
         const previousClose = price.regularMarketPreviousClose/currencychange || 0;
-        const change = price.regularMarketChange/currencychange || 0;
+        const change = price.regularMarketChange * currencychange || 0;
         const changePercent = price.regularMarketChangePercent || 0;
         const currency = price.currency ?? "INR";
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
-   "change": 0.0625,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:28:24
         const price = res.value.price;
         const lastPrice = price.regularMarketPrice/currencychange || 0;
         const previousClose = price.regularMarketPreviousClose/currencychange || 0;
-        const change = price.regularMarketChange/currencychange || 0;
+        const change = false;
         const changePercent = price.regularMarketChangePercent || 0;
         const currency = price.currency ?? "INR";
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,18 +1,18 @@
  Object {
    "success": true,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:29:31
         const lastPrice = price.regularMarketPrice/currencychange || 0;
         const previousClose = price.regularMarketPreviousClose/currencychange || 0;
         const change = price.regularMarketChange/currencychange || 0;
-        const changePercent = price.regularMarketChangePercent || 0;
+        const changePercent = true;
         const currency = price.currency ?? "INR";
         const longname = price.longName ?? null;
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,17 +2,17 @@
    "success": true,
    "summary": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:29:31
         const lastPrice = price.regularMarketPrice/currencychange || 0;
         const previousClose = price.regularMarketPreviousClose/currencychange || 0;
         const change = price.regularMarketChange/currencychange || 0;
-        const changePercent = price.regularMarketChangePercent || 0;
+        const changePercent = false;
         const currency = price.currency ?? "INR";
         const longname = price.longName ?? null;
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,17 +2,17 @@
    "success": true,
    "summary": Array [

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:30:26
         const previousClose = price.regularMarketPreviousClose/currencychange || 0;
         const change = price.regularMarketChange/currencychange || 0;
         const changePercent = price.regularMarketChangePercent || 0;
-        const currency = price.currency ?? "INR";
+        const currency = price.currency && "INR";
         const longname = price.longName ?? null;
         const shortname= price.shortName ?? null;
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,16 +3,16 @@
    "summary": Array [
      Object {

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:31:26
         const change = price.regularMarketChange/currencychange || 0;
         const changePercent = price.regularMarketChangePercent || 0;
         const currency = price.currency ?? "INR";
-        const longname = price.longName ?? null;
+        const longname = price.longName && null;
         const shortname= price.shortName ?? null;
         const marketTime = new Date(price.regularMarketTime).toLocaleTimeString("en-IN", {
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,13 +6,13 @@
        "change": 0,
        "changePercent": 0,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:32:26
         const changePercent = price.regularMarketChangePercent || 0;
         const currency = price.currency ?? "INR";
         const longname = price.longName ?? null;
-        const shortname= price.shortName ?? null;
+        const shortname= price.shortName && null;
         const marketTime = new Date(price.regularMarketTime).toLocaleTimeString("en-IN", {
           timeZone: "Asia/Kolkata",
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,13 +8,13 @@
        "currency": "INR",
        "dayRange": "₹- → ₹-",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioSummary.controller.js:48:37
             shortname: shortname,
             longname: longname,
             change: change,
-            expiresAt: Date.now() + 60*1000
+            expiresAt: Date.now() + 60 / 1000
         });
         const shares = userHoldings[i].current_holding ?? 0;
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
    "change": 0.0625,

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioSummary.controller.js:48:24
             shortname: shortname,
             longname: longname,
             change: change,
-            expiresAt: Date.now() + 60*1000
+            expiresAt: Date.now() - 60 * 1000
         });
         const shares = userHoldings[i].current_holding ?? 0;
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
    "change": 0.0625,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:50:24
             change: change,
             expiresAt: Date.now() + 60*1000
         });
-        const shares = userHoldings[i].current_holding ?? 0;
+        const shares = userHoldings[i].current_holding && 0;
         const summary = res.value.summaryDetail;
         const dayLow = summary?.dayLow ?? "-";
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,12 +8,12 @@
        "currency": "INR",
        "dayRange": "₹- → ₹-",

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:52:24
         });
         const shares = userHoldings[i].current_holding ?? 0;
         const summary = res.value.summaryDetail;
-        const dayLow = summary?.dayLow ?? "-";
+        const dayLow = summary?.dayLow && "-";
         const dayHigh = summary?.dayHigh ?? "-";
         const yearLow = summary?.fiftyTwoWeekLow ?? "-";
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,15 +4,15 @@
      Object {
        "avgVolume": "-",

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:53:25
         const shares = userHoldings[i].current_holding ?? 0;
         const summary = res.value.summaryDetail;
         const dayLow = summary?.dayLow ?? "-";
-        const dayHigh = summary?.dayHigh ?? "-";
+        const dayHigh = summary?.dayHigh && "-";
         const yearLow = summary?.fiftyTwoWeekLow ?? "-";
         const yearHigh = summary?.fiftyTwoWeekHigh ?? "-";
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,15 +4,15 @@
      Object {
        "avgVolume": "-",

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:54:25
         const summary = res.value.summaryDetail;
         const dayLow = summary?.dayLow ?? "-";
         const dayHigh = summary?.dayHigh ?? "-";
-        const yearLow = summary?.fiftyTwoWeekLow ?? "-";
+        const yearLow = summary?.fiftyTwoWeekLow && "-";
         const yearHigh = summary?.fiftyTwoWeekHigh ?? "-";
         const avgVolume = summary?.averageVolume3Month ?? "-";
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,14 +8,14 @@
        "currency": "INR",
        "dayRange": "₹- → ₹-",

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:55:26
         const dayLow = summary?.dayLow ?? "-";
         const dayHigh = summary?.dayHigh ?? "-";
         const yearLow = summary?.fiftyTwoWeekLow ?? "-";
-        const yearHigh = summary?.fiftyTwoWeekHigh ?? "-";
+        const yearHigh = summary?.fiftyTwoWeekHigh && "-";
         const avgVolume = summary?.averageVolume3Month ?? "-";
         const volume = price.regularMarketVolume ?? "-";
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,14 +8,14 @@
        "currency": "INR",
        "dayRange": "₹- → ₹-",

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:56:27
         const dayHigh = summary?.dayHigh ?? "-";
         const yearLow = summary?.fiftyTwoWeekLow ?? "-";
         const yearHigh = summary?.fiftyTwoWeekHigh ?? "-";
-        const avgVolume = summary?.averageVolume3Month ?? "-";
+        const avgVolume = summary?.averageVolume3Month && "-";
         const volume = price.regularMarketVolume ?? "-";
         const marketCap = price.marketCap ? formatNumber(price.marketCap) : "-";
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,18 +1,18 @@
  Object {
    "success": true,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:57:24
         const yearLow = summary?.fiftyTwoWeekLow ?? "-";
         const yearHigh = summary?.fiftyTwoWeekHigh ?? "-";
         const avgVolume = summary?.averageVolume3Month ?? "-";
-        const volume = price.regularMarketVolume ?? "-";
+        const volume = price.regularMarketVolume && "-";
         const marketCap = price.marketCap ? formatNumber(price.marketCap) : "-";
 
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,14 +8,14 @@
        "currency": "USD",
        "dayRange": "₹148 → ₹152",

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:79:43
       })
       .filter(Boolean);
 
-    return res.status(200).json({success: true,summary: tableData});
+    return res.status(200).json({success: false,summary: tableData});
   } catch (error) {
     console.error("Error generating holdings table:", error);
killedBy: getSummaryTable handles all rejected YahooFinance calls (filters all out)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": true,
+   "success": false,

[Killed] BlockStatement
src/controllers/Portfolio/portfolioSummary.controller.js:80:19
       .filter(Boolean);
 
     return res.status(200).json({success: true,summary: tableData});
-  } catch (error) {
-    console.error("Error generating holdings table:", error);
-    return res.status(500).json({success:false,meaasge: error.meaasge})
-  }
+  } catch (error) {}
 };
 
killedBy: getSummaryTable returns 500 when getStockSummary throws (DB crash)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:82:42
     return res.status(200).json({success: true,summary: tableData});
   } catch (error) {
     console.error("Error generating holdings table:", error);
-    return res.status(500).json({success:false,meaasge: error.meaasge})
+    return res.status(500).json({success:true,meaasge: error.meaasge})
   }
 };
killedBy: getSummaryTable returns 500 when getStockSummary throws (DB crash)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "meaasge": undefined,
-   "success": false,

[Killed] BlockStatement
src/controllers/Portfolio/portfolioSummary.controller.js:86:30
   }
 };
 
-function formatNumber(value) {
-  if (!value || typeof value !== "number" ||Number.isNaN(value)) return "-";
-  const abs = Math.abs(Number(value));
-  if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
-  if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
-  if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
-  if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
-  return value.toFixed(2);
-}
+function formatNumber(value) {}
 
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
    "summary": Array [

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:87:7
 };
 
 function formatNumber(value) {
-  if (!value || typeof value !== "number" ||Number.isNaN(value)) return "-";
+  if (value || typeof value !== "number" ||Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
    "summary": Array [

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:87:7
 };
 
 function formatNumber(value) {
-  if (!value || typeof value !== "number" ||Number.isNaN(value)) return "-";
+  if (!value && typeof value !== "number" ||Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
killedBy: getSummaryTable handles missing price data and summaryDetail, returning defaults
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
    "summary": Array [

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:89:7
 function formatNumber(value) {
   if (!value || typeof value !== "number" ||Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
-  if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
+  if (abs < 1e12) return (value / 1e12).toFixed(2) + "T";
   if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
    "summary": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:89:7
 function formatNumber(value) {
   if (!value || typeof value !== "number" ||Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
-  if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
+  if (false) return (value / 1e12).toFixed(2) + "T";
   if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -7,12 +7,12 @@
        "changePercent": 3.45,
        "currency": "USD",

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:90:7
   if (!value || typeof value !== "number" ||Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
-  if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
+  if (abs > 1e9) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
   if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "success": true,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:90:7
   if (!value || typeof value !== "number" ||Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
-  if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
+  if (false) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
   if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "success": true,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:91:7
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
   if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
-  if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
+  if (true) return (value / 1e6).toFixed(2) + "M";
   if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
   return value.toFixed(2);
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -7,11 +7,11 @@
        "changePercent": 3.45,
        "currency": "USD",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:91:7
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
   if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
-  if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
+  if (false) return (value / 1e6).toFixed(2) + "M";
   if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
   return value.toFixed(2);
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
    "summary": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:92:7
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
   if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
-  if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
+  if (true) return (value / 1e3).toFixed(2) + "K";
   return value.toFixed(2);
 }
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,18 +1,18 @@
  Object {
    "success": true,
