[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:92:7
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
   if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
-  if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
+  if (false) return (value / 1e3).toFixed(2) + "K";
   return value.toFixed(2);
 }
killedBy: getSummaryTable computes summary table properly with all data and converts currency
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -7,11 +7,11 @@
        "changePercent": 3.45,
        "currency": "USD",
