[Killed] BlockStatement
src/db/findUser.js:3:44
 import { sql } from "./dbConnection.js";
 
-const searchUserByEmail = async (email) => {
-    try {
-        const row = await sql`SELECT * FROM "user" WHERE email = ${email}`;
-        return row;
-    } catch (error) {
-        console.error('Database error - searchUserByEmail',error);
-        return null;
-    }
-};
+const searchUserByEmail = async (email) => {};
 export { searchUserByEmail };
 
killedBy: searchUserByEmail should return user data when email exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/db/findUser.js:4:9
 import { sql } from "./dbConnection.js";
 
 const searchUserByEmail = async (email) => {
-    try {
-        const row = await sql`SELECT * FROM "user" WHERE email = ${email}`;
-        return row;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Database error - searchUserByEmail',error);
         return null;
killedBy: searchUserByEmail should return user data when email exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
