[Killed] ConditionalExpression
src/db/insertTransaction.js:10:16
         try {
             let price
             const holding_check = await sql`SELECT spended_amount,current_holding FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
-            if(holding_check.length===0){
+            if(true){
                 holding_check[0]={current_holding:0,spended_amount:0};
             }
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should allow SELL if holding equals quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/db/insertTransaction.js:10:16
         try {
             let price
             const holding_check = await sql`SELECT spended_amount,current_holding FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
-            if(holding_check.length===0){
+            if(holding_check.length !== 0){
                 holding_check[0]={current_holding:0,spended_amount:0};
             }
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should allow SELL if holding equals quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/db/insertTransaction.js:14:16
                 holding_check[0]={current_holding:0,spended_amount:0};
             }
             let old_holding = 0, old_spended_amount = 0;
-            if(transaction_type==='SELL'){                    
+            if(false){                    
                 if(holding_check[0].current_holding<quantity){  
                     return {success:false,message:"Insufficient holdings to sell."};
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should return error if SELL requested but holding is insufficient
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Insufficient holdings to sell.", "success": false}
Received: null

[Killed] ConditionalExpression
src/db/insertTransaction.js:14:16
                 holding_check[0]={current_holding:0,spended_amount:0};
             }
             let old_holding = 0, old_spended_amount = 0;
-            if(transaction_type==='SELL'){                    
+            if(true){                    
                 if(holding_check[0].current_holding<quantity){  
                     return {success:false,message:"Insufficient holdings to sell."};
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should initialize holding to 0 if no record exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 1

[Killed] BlockStatement
src/db/insertTransaction.js:15:62
             }
             let old_holding = 0, old_spended_amount = 0;
             if(transaction_type==='SELL'){                    
-                if(holding_check[0].current_holding<quantity){  
-                    return {success:false,message:"Insufficient holdings to sell."};
-                } 
+                if(holding_check[0].current_holding<quantity){} 
             }
             old_holding = Number(holding_check[0].current_holding);
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should return error if SELL requested but holding is insufficient
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Insufficient holdings to sell.", "success": false}
Received: null

[Killed] EqualityOperator
src/db/insertTransaction.js:15:20
             }
             let old_holding = 0, old_spended_amount = 0;
             if(transaction_type==='SELL'){                    
-                if(holding_check[0].current_holding<quantity){  
+                if(holding_check[0].current_holding <= quantity){  
                     return {success:false,message:"Insufficient holdings to sell."};
                 } 
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should allow SELL if holding equals quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/db/insertTransaction.js:16:37
             let old_holding = 0, old_spended_amount = 0;
             if(transaction_type==='SELL'){                    
                 if(holding_check[0].current_holding<quantity){  
-                    return {success:false,message:"Insufficient holdings to sell."};
+                    return {success:true,message:"Insufficient holdings to sell."};
                 } 
             }
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should return error if SELL requested but holding is insufficient
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "message": "Insufficient holdings to sell.",
-   "success": false,

[Killed] EqualityOperator
src/db/insertTransaction.js:21:17
             }
             old_holding = Number(holding_check[0].current_holding);
             old_spended_amount = Number(holding_check[0].avg_price);
-            if (transaction_type === 'BUY') {
+            if (transaction_type !== 'BUY') {
                 const check = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
                 if (check.length === 0) {
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should allow SELL if holding equals quantity
statusReason: TypeError: Cannot read properties of null (reading 'success')

[Killed] ConditionalExpression
src/db/insertTransaction.js:21:17
             }
             old_holding = Number(holding_check[0].current_holding);
             old_spended_amount = Number(holding_check[0].avg_price);
-            if (transaction_type === 'BUY') {
+            if (true) {
                 const check = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
                 if (check.length === 0) {
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should allow SELL if holding equals quantity
statusReason: TypeError: Cannot read properties of null (reading 'success')

[Killed] ConditionalExpression
src/db/insertTransaction.js:23:21
             old_spended_amount = Number(holding_check[0].avg_price);
             if (transaction_type === 'BUY') {
                 const check = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
-                if (check.length === 0) {
+                if (false) {
                     const quoteSummary = await yahooFinance.quoteSummary(symbol, {modules: ["assetProfile", "price"]});
                     if (!quoteSummary.price) {
killedBy: insertTransaction Database Function BUY Transaction Flow should fetch YahooFinance data and insert stock if not in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AAPL", {"modules": ["assetProfile", "price"]}

Number of calls: 0

[Killed] ConditionalExpression
src/db/insertTransaction.js:23:21
             old_spended_amount = Number(holding_check[0].avg_price);
             if (transaction_type === 'BUY') {
                 const check = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
-                if (check.length === 0) {
+                if (true) {
                     const quoteSummary = await yahooFinance.quoteSummary(symbol, {modules: ["assetProfile", "price"]});
                     if (!quoteSummary.price) {
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should initialize holding to 0 if no record exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 2

[Killed] BooleanLiteral
src/db/insertTransaction.js:25:25
                 const check = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
                 if (check.length === 0) {
                     const quoteSummary = await yahooFinance.quoteSummary(symbol, {modules: ["assetProfile", "price"]});
-                    if (!quoteSummary.price) {
+                    if (quoteSummary.price) {
                         return { success: false, message: "Unable to fetch stock details." };
                     }
killedBy: insertTransaction Database Function BUY Transaction Flow should fetch YahooFinance data and insert stock if not in DB
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "USD"

Number of calls: 0

[Killed] ConditionalExpression
src/db/insertTransaction.js:49:16
                     `;
                 }
             }
-            if(!price) price = await getPrice(symbol);
+            if(false) price = await getPrice(symbol);
             price = price.current;
             let new_avg_price = 0;
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should allow SELL if holding equals quantity
statusReason: TypeError: Cannot read properties of null (reading 'success')

[Killed] BooleanLiteral
src/db/insertTransaction.js:49:16
                     `;
                 }
             }
-            if(!price) price = await getPrice(symbol);
+            if(price) price = await getPrice(symbol);
             price = price.current;
             let new_avg_price = 0;
killedBy: insertTransaction Database Function Input Validation & Holdings Checks should allow SELL if holding equals quantity
statusReason: TypeError: Cannot read properties of null (reading 'success')

[Killed] ConditionalExpression
src/db/insertTransaction.js:53:16
             price = price.current;
             let new_avg_price = 0;
             let profit = 0;
-            if(transaction_type==='SELL'){
+            if(true){
                 profit = (price - old_spended_amount) * quantity;
                 quantity = -quantity;
killedBy: insertTransaction Database Function Mathematical Logic Mutations should compute BUY weighted avg and totalSpend correctly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 150
Received array: ["test@example.com", "AAPL", -10, -2000, NaN, -10, -2000, NaN, 1000, "test@example.com", …]

[Killed] ConditionalExpression
src/db/insertTransaction.js:53:16
             price = price.current;
             let new_avg_price = 0;
             let profit = 0;
-            if(transaction_type==='SELL'){
+            if(false){
                 profit = (price - old_spended_amount) * quantity;
                 quantity = -quantity;
killedBy: insertTransaction Database Function SELL Transaction Flow & Calculations should correctly compute profit, negative quantity, avg price, and SQL updates
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: -5
Received array: ["test@example.com", "AAPL", 5, 600, 106.66666666666667, 5, 600, 106.66666666666667, 0, "test@example.com", …]

[Survived] ArithmeticOperator
src/db/insertTransaction.js:54:27
             let new_avg_price = 0;
             let profit = 0;
             if(transaction_type==='SELL'){
-                profit = (price - old_spended_amount) * quantity;
+                profit = (price + old_spended_amount) * quantity;
                 quantity = -quantity;
                 new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding + quantity);

[Survived] ArithmeticOperator
src/db/insertTransaction.js:54:26
             let new_avg_price = 0;
             let profit = 0;
             if(transaction_type==='SELL'){
-                profit = (price - old_spended_amount) * quantity;
+                profit = (price - old_spended_amount) / quantity;
                 quantity = -quantity;
                 new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding + quantity);

[Killed] UnaryOperator
src/db/insertTransaction.js:55:28
             let profit = 0;
             if(transaction_type==='SELL'){
                 profit = (price - old_spended_amount) * quantity;
-                quantity = -quantity;
+                quantity = +quantity;
                 new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding + quantity);
             }
killedBy: insertTransaction Database Function SELL Transaction Flow & Calculations should correctly compute profit, negative quantity, avg price, and SQL updates
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: -5
Received array: ["test@example.com", "AAPL", 5, 600, 100, 5, 600, 100, 100, "test@example.com", …]

[Survived] ArithmeticOperator
src/db/insertTransaction.js:56:34
             if(transaction_type==='SELL'){
                 profit = (price - old_spended_amount) * quantity;
                 quantity = -quantity;
-                new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding + quantity);
+                new_avg_price = (old_spended_amount / (old_holding + quantity))/(old_holding + quantity);
             }
             else{

[Survived] ArithmeticOperator
src/db/insertTransaction.js:56:82
             if(transaction_type==='SELL'){
                 profit = (price - old_spended_amount) * quantity;
                 quantity = -quantity;
-                new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding + quantity);
+                new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding - quantity);
             }
             else{

[Killed] BlockStatement
src/db/insertTransaction.js:58:17
                 quantity = -quantity;
                 new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding + quantity);
             }
-            else{
-                new_avg_price = ((old_spended_amount * old_holding) + (price * quantity))/(old_holding + quantity)
-            }
+            else{}
             const totalSpend = price * quantity;
             
killedBy: insertTransaction Database Function Mathematical Logic Mutations should compute BUY weighted avg and totalSpend correctly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 150
Received array: ["test@example.com", "AAPL", 10, 2000, 0, 10, 2000, 0, 0, "test@example.com", …]

[Killed] ArithmeticOperator
src/db/insertTransaction.js:59:92
                 new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding + quantity);
             }
             else{
-                new_avg_price = ((old_spended_amount * old_holding) + (price * quantity))/(old_holding + quantity)
+                new_avg_price = ((old_spended_amount * old_holding) + (price * quantity))/(old_holding - quantity)
             }
             const totalSpend = price * quantity;
killedBy: insertTransaction Database Function Mathematical Logic Mutations should compute BUY weighted avg and totalSpend correctly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 150
Received array: ["test@example.com", "AAPL", 10, 2000, Infinity, 10, 2000, Infinity, 0, "test@example.com", …]

[Killed] ArithmeticOperator
src/db/insertTransaction.js:59:34
                 new_avg_price = (old_spended_amount * (old_holding + quantity))/(old_holding + quantity);
             }
             else{
-                new_avg_price = ((old_spended_amount * old_holding) + (price * quantity))/(old_holding + quantity)
+                new_avg_price = (old_spended_amount * old_holding - price * quantity)/(old_holding + quantity)
             }
             const totalSpend = price * quantity;
killedBy: insertTransaction Database Function Mathematical Logic Mutations should compute BUY weighted avg and totalSpend correctly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 150
Received array: ["test@example.com", "AAPL", 10, 2000, -50, 10, 2000, -50, 0, "test@example.com", …]

[Killed] ArithmeticOperator
src/db/insertTransaction.js:61:32
             else{
                 new_avg_price = ((old_spended_amount * old_holding) + (price * quantity))/(old_holding + quantity)
             }
-            const totalSpend = price * quantity;
+            const totalSpend = price / quantity;
             
             const queries = [sql`
killedBy: insertTransaction Database Function SELL Transaction Flow & Calculations should correctly compute profit, negative quantity, avg price, and SQL updates
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: -600
Received array: ["test@example.com", "AAPL", -5, -24, 100, -5, -24, 100, 100, "test@example.com", …]

[Killed] BlockStatement
src/db/insertTransaction.js:81:25
             `];
             const [insert,update] = await sql.transaction(queries);
             return {success:true,insert, update};
-        } catch (error) {
-            console.error('Error inserting transaction:', error);
-            return null;
-        }
+        } catch (error) {}
     };
killedBy: insertTransaction Database Function SELL Transaction Flow & Calculations should return null if getPrice fails
statusReason: Error: expect(received).toBeNull()

Received: undefined
