[Killed] BlockStatement
src/db/deleteActiveSession.js:3:53
 import { sql } from "./dbConnection.js";
 
-const deleteActiveSessionByToken = async (token) => {
-    try {
-        if(token === null || token === undefined || token === "") return null;
-        const row = await sql`Delete FROM "active_session" WHERE token = ${token}`;
-        return row;
-    } catch (error) {
-        console.error('Database error - deleteAcriveSessionByToken',error);
-        return null;
-    }
-};
+const deleteActiveSessionByToken = async (token) => {};
 
 const deleteActiveSessionByEmail = async (email) => {
killedBy: deleteActiveSession DB methods deleteActiveSessionByToken() Happy Path should delete session when valid token is provided and return []
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/db/deleteActiveSession.js:4:9
 import { sql } from "./dbConnection.js";
 
 const deleteActiveSessionByToken = async (token) => {
-    try {
-        if(token === null || token === undefined || token === "") return null;
-        const row = await sql`Delete FROM "active_session" WHERE token = ${token}`;
-        return row;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Database error - deleteAcriveSessionByToken',error);
         return null;
killedBy: deleteActiveSession DB methods deleteActiveSessionByToken() Happy Path should delete session when valid token is provided and return []
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] EqualityOperator
src/db/deleteActiveSession.js:5:53
 
 const deleteActiveSessionByToken = async (token) => {
     try {
-        if(token === null || token === undefined || token === "") return null;
+        if(token === null || token === undefined || token !== "") return null;
         const row = await sql`Delete FROM "active_session" WHERE token = ${token}`;
         return row;
killedBy: deleteActiveSession DB methods deleteActiveSessionByToken() Happy Path should delete session when valid token is provided and return []
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: null

[Killed] LogicalOperator
src/db/deleteActiveSession.js:5:12
 
 const deleteActiveSessionByToken = async (token) => {
     try {
-        if(token === null || token === undefined || token === "") return null;
+        if(token === null && token === undefined || token === "") return null;
         const row = await sql`Delete FROM "active_session" WHERE token = ${token}`;
         return row;
killedBy: deleteActiveSession DB methods deleteActiveSessionByToken() Edge Cases should return null and NOT call DB on null token
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["Delete FROM \"active_session\" WHERE token = ", ""], null

[Killed] BlockStatement
src/db/deleteActiveSession.js:8:21
         if(token === null || token === undefined || token === "") return null;
         const row = await sql`Delete FROM "active_session" WHERE token = ${token}`;
         return row;
-    } catch (error) {
-        console.error('Database error - deleteAcriveSessionByToken',error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: deleteActiveSession DB methods deleteActiveSessionByToken() Edge Cases should return null when DB throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/db/deleteActiveSession.js:14:53
     }
 };
 
-const deleteActiveSessionByEmail = async (email) => {
-    try {
-        if(email === null || email === undefined || email === "") return null;
-        const row = await sql`Delete FROM "active_session" WHERE email = ${email}`;
-        return row;
-    } catch (error) {
-        console.error('Database error - deleteAcriveSessionByEmail',error);
-        return null;
-    }
-};
+const deleteActiveSessionByEmail = async (email) => {};
 
 export { deleteActiveSessionByToken, deleteActiveSessionByEmail };
killedBy: deleteActiveSession DB methods deleteActiveSessionByEmail() Happy Path should delete session and return [] when a valid email is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/db/deleteActiveSession.js:15:9
 };
 
 const deleteActiveSessionByEmail = async (email) => {
-    try {
-        if(email === null || email === undefined || email === "") return null;
-        const row = await sql`Delete FROM "active_session" WHERE email = ${email}`;
-        return row;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Database error - deleteAcriveSessionByEmail',error);
         return null;
killedBy: deleteActiveSession DB methods deleteActiveSessionByEmail() Happy Path should delete session and return [] when a valid email is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] LogicalOperator
src/db/deleteActiveSession.js:16:12
 
 const deleteActiveSessionByEmail = async (email) => {
     try {
-        if(email === null || email === undefined || email === "") return null;
+        if(email === null && email === undefined || email === "") return null;
         const row = await sql`Delete FROM "active_session" WHERE email = ${email}`;
         return row;
killedBy: deleteActiveSession DB methods deleteActiveSessionByEmail() Edge Cases should return null and NOT call DB when null email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["Delete FROM \"active_session\" WHERE email = ", ""], null

[Killed] ConditionalExpression
src/db/deleteActiveSession.js:16:12
 
 const deleteActiveSessionByEmail = async (email) => {
     try {
-        if(email === null || email === undefined || email === "") return null;
+        if(true) return null;
         const row = await sql`Delete FROM "active_session" WHERE email = ${email}`;
         return row;
killedBy: deleteActiveSession DB methods deleteActiveSessionByEmail() Happy Path should delete session and return [] when a valid email is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: null

[Killed] BlockStatement
src/db/deleteActiveSession.js:19:21
         if(email === null || email === undefined || email === "") return null;
         const row = await sql`Delete FROM "active_session" WHERE email = ${email}`;
         return row;
-    } catch (error) {
-        console.error('Database error - deleteAcriveSessionByEmail',error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: deleteActiveSession DB methods deleteActiveSessionByEmail() Edge Cases should return null when database throws an error
statusReason: Error: expect(received).toBeNull()

Received: undefined
