[Killed] BlockStatement
src/db/getActiveSession.js:3:52
 import { sql } from "./dbConnection.js";
 
-const getAllActiveSessionOfUser = async (email) => {
-    try {
-        if(email === null || email === undefined || email === "") return null;
-        const result =
-            await sql`SELECT token,browser_type,os_type,last_active_time FROM "active_session" WHERE email = ${email}`;
-        return result;
-    } catch (error) {
-        console.error("Database Error - getAllActiveSessionOfUser",error);
-        return null;
-    }
-};
+const getAllActiveSessionOfUser = async (email) => {};
 
 const getActiveSessionByToken = async (token) => {
killedBy: Active Session Fetch Methods getAllActiveSessionOfUser() Happy Paths should return all active sessions for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"browser_type": "Chrome", "os_type": "Windows", "token": "t1"}]
Received: undefined

[Killed] BlockStatement
src/db/getActiveSession.js:4:9
 import { sql } from "./dbConnection.js";
 
 const getAllActiveSessionOfUser = async (email) => {
-    try {
-        if(email === null || email === undefined || email === "") return null;
-        const result =
-            await sql`SELECT token,browser_type,os_type,last_active_time FROM "active_session" WHERE email = ${email}`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Database Error - getAllActiveSessionOfUser",error);
         return null;
killedBy: Active Session Fetch Methods getAllActiveSessionOfUser() Happy Paths should return all active sessions for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"browser_type": "Chrome", "os_type": "Windows", "token": "t1"}]
Received: undefined

[Killed] ConditionalExpression
src/db/getActiveSession.js:5:53
 
 const getAllActiveSessionOfUser = async (email) => {
     try {
-        if(email === null || email === undefined || email === "") return null;
+        if(email === null || email === undefined || false) return null;
         const result =
             await sql`SELECT token,browser_type,os_type,last_active_time FROM "active_session" WHERE email = ${email}`;
killedBy: Active Session Fetch Methods getAllActiveSessionOfUser() Edge Cases should return null for empty email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["SELECT token,browser_type,os_type,last_active_time FROM \"active_session\" WHERE email = ", ""], ""

[Timeout] BlockStatement
src/db/getActiveSession.js:9:21
         const result =
             await sql`SELECT token,browser_type,os_type,last_active_time FROM "active_session" WHERE email = ${email}`;
         return result;
-    } catch (error) {
-        console.error("Database Error - getAllActiveSessionOfUser",error);
-        return null;
-    }
+    } catch (error) {}
 };
 

[Timeout] BlockStatement
src/db/getActiveSession.js:15:50
     }
 };
 
-const getActiveSessionByToken = async (token) => {
-    try {
-        if(token === null || token === undefined || token === "") return null;
-        const result =
-            await sql`SELECT email,browser_type,os_type,last_active_time FROM "active_session" WHERE token = ${token}`;
-        return result;
-    } catch (error) {
-        console.error("Database Error - getActiveSessionByToken",error);
-        return null;
-    }
-};
+const getActiveSessionByToken = async (token) => {};
 
 export { getAllActiveSessionOfUser, getActiveSessionByToken };

[Timeout] BlockStatement
src/db/getActiveSession.js:16:9
 };
 
 const getActiveSessionByToken = async (token) => {
-    try {
-        if(token === null || token === undefined || token === "") return null;
-        const result =
-            await sql`SELECT email,browser_type,os_type,last_active_time FROM "active_session" WHERE token = ${token}`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Database Error - getActiveSessionByToken",error);
         return null;

[Timeout] LogicalOperator
src/db/getActiveSession.js:17:12
 
 const getActiveSessionByToken = async (token) => {
     try {
-        if(token === null || token === undefined || token === "") return null;
+        if((token === null || token === undefined) && token === "") return null;
         const result =
             await sql`SELECT email,browser_type,os_type,last_active_time FROM "active_session" WHERE token = ${token}`;

[Timeout] BlockStatement
src/db/getActiveSession.js:21:21
         const result =
             await sql`SELECT email,browser_type,os_type,last_active_time FROM "active_session" WHERE token = ${token}`;
         return result;
-    } catch (error) {
-        console.error("Database Error - getActiveSessionByToken",error);
-        return null;
-    }
+    } catch (error) {}
 };
 
