[Timeout] BlockStatement
src/db/insertActiveSession.js:3:79
 import { sql } from "./dbConnection.js"; 
 
-const insertActiveSession = async ({ token, email, browser_type, os_type}) => {
-    if(token === null || token === undefined || token === "") return null;
-    if(email === null || email === undefined || email === "") return null;
-    if(browser_type === null || browser_type === undefined || browser_type === "") return null;
-    if(os_type === null || os_type === undefined || os_type === "") return null;
-    try {
-        const result = await sql`INSERT INTO "active_session" (token,email,browser_type,os_type) VALUES (${token},${email},${browser_type},${os_type})RETURNING email`;
-        return result; 
-    } catch (error) {
-        console.error('Database Error - insertActiveSession',error);
-        return null;
-    }
-}
+const insertActiveSession = async ({ token, email, browser_type, os_type}) => {}
 export { insertActiveSession };

[Killed] LogicalOperator
src/db/insertActiveSession.js:4:8
 import { sql } from "./dbConnection.js"; 
 
 const insertActiveSession = async ({ token, email, browser_type, os_type}) => {
-    if(token === null || token === undefined || token === "") return null;
+    if((token === null || token === undefined) && token === "") return null;
     if(email === null || email === undefined || email === "") return null;
     if(browser_type === null || browser_type === undefined || browser_type === "") return null;
killedBy: insertActiveSession() Validation tests — should NOT call DB should return null if token is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["INSERT INTO \"active_session\" (token,email,browser_type,os_type) VALUES (", ",", ",", ",", ")RETURNING email"], null, "e@example.com", "Chrome", "Windows"

[Killed] ConditionalExpression
src/db/insertActiveSession.js:4:8
 import { sql } from "./dbConnection.js"; 
 
 const insertActiveSession = async ({ token, email, browser_type, os_type}) => {
-    if(token === null || token === undefined || token === "") return null;
+    if(false) return null;
     if(email === null || email === undefined || email === "") return null;
     if(browser_type === null || browser_type === undefined || browser_type === "") return null;
killedBy: insertActiveSession() Validation tests — should NOT call DB should return null if token is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["INSERT INTO \"active_session\" (token,email,browser_type,os_type) VALUES (", ",", ",", ",", ")RETURNING email"], null, "e@example.com", "Chrome", "Windows"

[Killed] LogicalOperator
src/db/insertActiveSession.js:5:8
 
 const insertActiveSession = async ({ token, email, browser_type, os_type}) => {
     if(token === null || token === undefined || token === "") return null;
-    if(email === null || email === undefined || email === "") return null;
+    if((email === null || email === undefined) && email === "") return null;
     if(browser_type === null || browser_type === undefined || browser_type === "") return null;
     if(os_type === null || os_type === undefined || os_type === "") return null;
killedBy: insertActiveSession() Validation tests — should NOT call DB should return null if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["INSERT INTO \"active_session\" (token,email,browser_type,os_type) VALUES (", ",", ",", ",", ")RETURNING email"], "t1", null, "Chrome", "Windows"

[Killed] ConditionalExpression
src/db/insertActiveSession.js:5:8
 
 const insertActiveSession = async ({ token, email, browser_type, os_type}) => {
     if(token === null || token === undefined || token === "") return null;
-    if(email === null || email === undefined || email === "") return null;
+    if(true) return null;
     if(browser_type === null || browser_type === undefined || browser_type === "") return null;
     if(os_type === null || os_type === undefined || os_type === "") return null;
killedBy: insertActiveSession() should insert active session and return result for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "test@example.com"}]
Received: null

[Killed] ConditionalExpression
src/db/insertActiveSession.js:6:33
 const insertActiveSession = async ({ token, email, browser_type, os_type}) => {
     if(token === null || token === undefined || token === "") return null;
     if(email === null || email === undefined || email === "") return null;
-    if(browser_type === null || browser_type === undefined || browser_type === "") return null;
+    if(browser_type === null || false || browser_type === "") return null;
     if(os_type === null || os_type === undefined || os_type === "") return null;
     try {
killedBy: insertActiveSession() Validation tests — should NOT call DB should return null if browser_type is 'undefined'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["INSERT INTO \"active_session\" (token,email,browser_type,os_type) VALUES (", ",", ",", ",", ")RETURNING email"], "t1", "e@example.com", undefined, "Windows"

[Killed] ConditionalExpression
src/db/insertActiveSession.js:6:8
 const insertActiveSession = async ({ token, email, browser_type, os_type}) => {
     if(token === null || token === undefined || token === "") return null;
     if(email === null || email === undefined || email === "") return null;
-    if(browser_type === null || browser_type === undefined || browser_type === "") return null;
+    if(false || browser_type === undefined || browser_type === "") return null;
     if(os_type === null || os_type === undefined || os_type === "") return null;
     try {
killedBy: insertActiveSession() Validation tests — should NOT call DB should return null if browser_type is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["INSERT INTO \"active_session\" (token,email,browser_type,os_type) VALUES (", ",", ",", ",", ")RETURNING email"], "t1", "e@example.com", null, "Windows"

[Killed] ConditionalExpression
src/db/insertActiveSession.js:7:8
     if(token === null || token === undefined || token === "") return null;
     if(email === null || email === undefined || email === "") return null;
     if(browser_type === null || browser_type === undefined || browser_type === "") return null;
-    if(os_type === null || os_type === undefined || os_type === "") return null;
+    if(true) return null;
     try {
         const result = await sql`INSERT INTO "active_session" (token,email,browser_type,os_type) VALUES (${token},${email},${browser_type},${os_type})RETURNING email`;
killedBy: insertActiveSession() should insert active session and return result for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "test@example.com"}]
Received: null

[Killed] ConditionalExpression
src/db/insertActiveSession.js:7:53
     if(token === null || token === undefined || token === "") return null;
     if(email === null || email === undefined || email === "") return null;
     if(browser_type === null || browser_type === undefined || browser_type === "") return null;
-    if(os_type === null || os_type === undefined || os_type === "") return null;
+    if(os_type === null || os_type === undefined || false) return null;
     try {
         const result = await sql`INSERT INTO "active_session" (token,email,browser_type,os_type) VALUES (${token},${email},${browser_type},${os_type})RETURNING email`;
killedBy: insertActiveSession() Validation tests — should NOT call DB should return null if os_type is ''
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["INSERT INTO \"active_session\" (token,email,browser_type,os_type) VALUES (", ",", ",", ",", ")RETURNING email"], "t1", "e@example.com", "Chrome", ""

[Killed] BlockStatement
src/db/insertActiveSession.js:8:9
     if(email === null || email === undefined || email === "") return null;
     if(browser_type === null || browser_type === undefined || browser_type === "") return null;
     if(os_type === null || os_type === undefined || os_type === "") return null;
-    try {
-        const result = await sql`INSERT INTO "active_session" (token,email,browser_type,os_type) VALUES (${token},${email},${browser_type},${os_type})RETURNING email`;
-        return result; 
-    } catch (error) {
+    try {} catch (error) {
         console.error('Database Error - insertActiveSession',error);
         return null;
killedBy: insertActiveSession() should insert active session and return result for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "test@example.com"}]
Received: undefined

[Killed] BlockStatement
src/db/insertActiveSession.js:11:21
     try {
         const result = await sql`INSERT INTO "active_session" (token,email,browser_type,os_type) VALUES (${token},${email},${browser_type},${os_type})RETURNING email`;
         return result; 
-    } catch (error) {
-        console.error('Database Error - insertActiveSession',error);
-        return null;
-    }
+    } catch (error) {}
 }
 export { insertActiveSession };
killedBy: insertActiveSession() should return null when DB throws error(ex.if email not exists)
statusReason: Error: expect(received).toBeNull()

Received: undefined
