[Killed] BlockStatement
src/db/removeUser.js:3:44
 import { sql } from "./dbConnection.js";
 
-const deleteUserByEmail = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
-    try {
-        const row = await sql`Delete FROM "user" WHERE email = ${email}`;
-        return row;
-    } catch (error) {
-        console.error('Database error - deleteUserByEmail',error);
-        return null;
-    }
-};
+const deleteUserByEmail = async (email) => {};
 export { deleteUserByEmail };
killedBy: deleteUserByEmail() should delete user and return [] for valid email or email that doesn't exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] LogicalOperator
src/db/removeUser.js:4:8
 import { sql } from "./dbConnection.js";
 
 const deleteUserByEmail = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null && email === undefined || email === "") return null;
     try {
         const row = await sql`Delete FROM "user" WHERE email = ${email}`;
killedBy: deleteUserByEmail() should return null for null email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["Delete FROM \"user\" WHERE email = ", ""], null

[Killed] ConditionalExpression
src/db/removeUser.js:4:49
 import { sql } from "./dbConnection.js";
 
 const deleteUserByEmail = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null || email === undefined || false) return null;
     try {
         const row = await sql`Delete FROM "user" WHERE email = ${email}`;
killedBy: deleteUserByEmail() should return null for empty email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["Delete FROM \"user\" WHERE email = ", ""], ""

[Killed] BlockStatement
src/db/removeUser.js:5:9
 
 const deleteUserByEmail = async (email) => {
     if(email === null || email === undefined || email === "") return null;
-    try {
-        const row = await sql`Delete FROM "user" WHERE email = ${email}`;
-        return row;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Database error - deleteUserByEmail',error);
         return null;
killedBy: deleteUserByEmail() should delete user and return [] for valid email or email that doesn't exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/db/removeUser.js:8:21
     try {
         const row = await sql`Delete FROM "user" WHERE email = ${email}`;
         return row;
-    } catch (error) {
-        console.error('Database error - deleteUserByEmail',error);
-        return null;
-    }
+    } catch (error) {}
 };
 export { deleteUserByEmail };
killedBy: deleteUserByEmail() should return null when DB throws an error
statusReason: Error: expect(received).toBeNull()

Received: undefined
