[Timeout] BlockStatement
src/db/toggleAiSuggestion.js:3:45
 import { sql } from "./dbConnection.js";
 
-const toggleAiSuggestion = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET aiSuggestion = NOT aiSuggestion WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
-        console.error("Error updating password:", error);
-        return null;
-    }
-};
+const toggleAiSuggestion = async (email) => {};
 export { toggleAiSuggestion };
 

[Killed] LogicalOperator
src/db/toggleAiSuggestion.js:4:8
 import { sql } from "./dbConnection.js";
 
 const toggleAiSuggestion = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
+    if((email === null || email === undefined) && email === "") return null;
     try {
         const result =
killedBy: toggleAiSuggestion() should return null for empty email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET aiSuggestion = NOT aiSuggestion WHERE email=", " RETURNING id"], ""

[Killed] EqualityOperator
src/db/toggleAiSuggestion.js:4:49
 import { sql } from "./dbConnection.js";
 
 const toggleAiSuggestion = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null || email === undefined || email !== "") return null;
     try {
         const result =
killedBy: toggleAiSuggestion() should toggle aiSuggestion and return DB result for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 5}]
Received: null

[Killed] BlockStatement
src/db/toggleAiSuggestion.js:5:9
 
 const toggleAiSuggestion = async (email) => {
     if(email === null || email === undefined || email === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET aiSuggestion = NOT aiSuggestion WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating password:", error);
         return null;
killedBy: toggleAiSuggestion() should toggle aiSuggestion and return DB result for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 5}]
Received: undefined

[Killed] BlockStatement
src/db/toggleAiSuggestion.js:9:21
         const result =
             await sql`UPDATE "user" SET aiSuggestion = NOT aiSuggestion WHERE email=${email} RETURNING id`;
         return result;
-    } catch (error) {
-        console.error("Error updating password:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 export { toggleAiSuggestion };
killedBy: toggleAiSuggestion() should return null when DB throws an error
statusReason: Error: expect(received).toBeNull()

Received: undefined
