[Killed] BlockStatement
src/db/updateActiveTime.js:3:43
 import { sql } from "./dbConnection.js";
 
-const updateActiveTime = async (token) => {
-    if(token === null || token === undefined || token === "") return null;
-    try {
-        const result = await sql`UPDATE "active_session" SET last_active_time=CURRENT_TIMESTAMP WHERE token=${token} RETURNING email`;
-        return result;
-    } catch (error) {
-        console.error('Database Error - updateActiveTime',error);
-        return null;
-    }
-}
+const updateActiveTime = async (token) => {}
 export { updateActiveTime };
killedBy: updateActiveTime() should update last_active_time and return result for valid token
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "test@example.com"}]
Received: undefined

[Killed] LogicalOperator
src/db/updateActiveTime.js:4:8
 import { sql } from "./dbConnection.js";
 
 const updateActiveTime = async (token) => {
-    if(token === null || token === undefined || token === "") return null;
+    if((token === null || token === undefined) && token === "") return null;
     try {
         const result = await sql`UPDATE "active_session" SET last_active_time=CURRENT_TIMESTAMP WHERE token=${token} RETURNING email`;
killedBy: updateActiveTime() should return null for empty token
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"active_session\" SET last_active_time=CURRENT_TIMESTAMP WHERE token=", " RETURNING email"], ""

[Killed] LogicalOperator
src/db/updateActiveTime.js:4:8
 import { sql } from "./dbConnection.js";
 
 const updateActiveTime = async (token) => {
-    if(token === null || token === undefined || token === "") return null;
+    if(token === null && token === undefined || token === "") return null;
     try {
         const result = await sql`UPDATE "active_session" SET last_active_time=CURRENT_TIMESTAMP WHERE token=${token} RETURNING email`;
killedBy: updateActiveTime() should return null for null token
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"active_session\" SET last_active_time=CURRENT_TIMESTAMP WHERE token=", " RETURNING email"], null

[Timeout] BlockStatement
src/db/updateActiveTime.js:5:9
 
 const updateActiveTime = async (token) => {
     if(token === null || token === undefined || token === "") return null;
-    try {
-        const result = await sql`UPDATE "active_session" SET last_active_time=CURRENT_TIMESTAMP WHERE token=${token} RETURNING email`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Database Error - updateActiveTime',error);
         return null;

[Timeout] BlockStatement
src/db/updateActiveTime.js:8:21
     try {
         const result = await sql`UPDATE "active_session" SET last_active_time=CURRENT_TIMESTAMP WHERE token=${token} RETURNING email`;
         return result;
-    } catch (error) {
-        console.error('Database Error - updateActiveTime',error);
-        return null;
-    }
+    } catch (error) {}
 }
 export { updateActiveTime };
