[Timeout] BlockStatement
src/db/updatePreferencesAndPersonalisation.js:3:45
 import { sql } from "./dbConnection.js";
 
-const updateTheme = async (email, theme) => {
-    if(email === null || email === undefined || email === "") return null;
-    if(theme === null || theme === undefined || theme === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET theme=${theme} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
-        console.error("Error updating theme:", error);
-        return null;
-    }
-};
+const updateTheme = async (email, theme) => {};
 
 const updateDashboardLayout = async (email, dashboardlayout) => {

[Killed] LogicalOperator
src/db/updatePreferencesAndPersonalisation.js:4:8
 import { sql } from "./dbConnection.js";
 
 const updateTheme = async (email, theme) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null && email === undefined || email === "") return null;
     if(theme === null || theme === undefined || theme === "") return null;
     try {
killedBy: User Settings Update Methods updateTheme() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET theme=", " WHERE email=", " RETURNING id"], "dark", null

[Killed] LogicalOperator
src/db/updatePreferencesAndPersonalisation.js:4:8
 import { sql } from "./dbConnection.js";
 
 const updateTheme = async (email, theme) => {
-    if(email === null || email === undefined || email === "") return null;
+    if((email === null || email === undefined) && email === "") return null;
     if(theme === null || theme === undefined || theme === "") return null;
     try {
killedBy: User Settings Update Methods updateTheme() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET theme=", " WHERE email=", " RETURNING id"], "dark", null

[Killed] ConditionalExpression
src/db/updatePreferencesAndPersonalisation.js:5:8
 
 const updateTheme = async (email, theme) => {
     if(email === null || email === undefined || email === "") return null;
-    if(theme === null || theme === undefined || theme === "") return null;
+    if(false) return null;
     try {
         const result =
killedBy: User Settings Update Methods updateTheme() should return null & NOT call DB if theme is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET theme=", " WHERE email=", " RETURNING id"], null, "user@example.com"

[Killed] ConditionalExpression
src/db/updatePreferencesAndPersonalisation.js:5:8
 
 const updateTheme = async (email, theme) => {
     if(email === null || email === undefined || email === "") return null;
-    if(theme === null || theme === undefined || theme === "") return null;
+    if(false || theme === "") return null;
     try {
         const result =
killedBy: User Settings Update Methods updateTheme() should return null & NOT call DB if theme is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET theme=", " WHERE email=", " RETURNING id"], null, "user@example.com"

[Killed] BlockStatement
src/db/updatePreferencesAndPersonalisation.js:6:9
 const updateTheme = async (email, theme) => {
     if(email === null || email === undefined || email === "") return null;
     if(theme === null || theme === undefined || theme === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET theme=${theme} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating theme:", error);
         return null;
killedBy: User Settings Update Methods updateTheme() should update theme for valid email and theme
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1}]
Received: undefined

[Killed] BlockStatement
src/db/updatePreferencesAndPersonalisation.js:10:21
         const result =
             await sql`UPDATE "user" SET theme=${theme} WHERE email=${email} RETURNING id`;
         return result;
-    } catch (error) {
-        console.error("Error updating theme:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: User Settings Update Methods updateTheme() should return null when DB throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/db/updatePreferencesAndPersonalisation.js:16:65
     }
 };
 
-const updateDashboardLayout = async (email, dashboardlayout) => {
-    if(email === null || email === undefined || email === "") return null;
-    if(dashboardlayout === null || dashboardlayout === undefined || dashboardlayout === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET dashboardlayout=${dashboardlayout} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
-        console.error("Error updating dashboard layout:", error);
-        return null;
-    }
-};
+const updateDashboardLayout = async (email, dashboardlayout) => {};
 
 export { updateTheme, updateDashboardLayout };
killedBy: User Settings Update Methods updateDashboardLayout() should update dashboardlayout for valid email and layout
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 3}]
Received: undefined

[Killed] LogicalOperator
src/db/updatePreferencesAndPersonalisation.js:17:8
 };
 
 const updateDashboardLayout = async (email, dashboardlayout) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null && email === undefined || email === "") return null;
     if(dashboardlayout === null || dashboardlayout === undefined || dashboardlayout === "") return null;
     try {
killedBy: User Settings Update Methods updateDashboardLayout() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET dashboardlayout=", " WHERE email=", " RETURNING id"], "layout1", null

[Killed] ConditionalExpression
src/db/updatePreferencesAndPersonalisation.js:17:8
 };
 
 const updateDashboardLayout = async (email, dashboardlayout) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(true) return null;
     if(dashboardlayout === null || dashboardlayout === undefined || dashboardlayout === "") return null;
     try {
killedBy: User Settings Update Methods updateDashboardLayout() should update dashboardlayout for valid email and layout
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 3}]
Received: null

[Killed] LogicalOperator
src/db/updatePreferencesAndPersonalisation.js:18:8
 
 const updateDashboardLayout = async (email, dashboardlayout) => {
     if(email === null || email === undefined || email === "") return null;
-    if(dashboardlayout === null || dashboardlayout === undefined || dashboardlayout === "") return null;
+    if(dashboardlayout === null && dashboardlayout === undefined || dashboardlayout === "") return null;
     try {
         const result =
killedBy: User Settings Update Methods updateDashboardLayout() should return null & NOT call DB if dashboardlayout is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET dashboardlayout=", " WHERE email=", " RETURNING id"], null, "user@example.com"

[Killed] ConditionalExpression
src/db/updatePreferencesAndPersonalisation.js:18:8
 
 const updateDashboardLayout = async (email, dashboardlayout) => {
     if(email === null || email === undefined || email === "") return null;
-    if(dashboardlayout === null || dashboardlayout === undefined || dashboardlayout === "") return null;
+    if(true) return null;
     try {
         const result =
killedBy: User Settings Update Methods updateDashboardLayout() should update dashboardlayout for valid email and layout
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 3}]
Received: null

[Killed] BlockStatement
src/db/updatePreferencesAndPersonalisation.js:19:9
 const updateDashboardLayout = async (email, dashboardlayout) => {
     if(email === null || email === undefined || email === "") return null;
     if(dashboardlayout === null || dashboardlayout === undefined || dashboardlayout === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET dashboardlayout=${dashboardlayout} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating dashboard layout:", error);
         return null;
killedBy: User Settings Update Methods updateDashboardLayout() should update dashboardlayout for valid email and layout
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 3}]
Received: undefined

[Killed] BlockStatement
src/db/updatePreferencesAndPersonalisation.js:23:21
         const result =
             await sql`UPDATE "user" SET dashboardlayout=${dashboardlayout} WHERE email=${email} RETURNING id`;
         return result;
-    } catch (error) {
-        console.error("Error updating dashboard layout:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: User Settings Update Methods updateDashboardLayout() should return null when DB throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined
