[Timeout] BlockStatement
src/db/updateProfileImage.js:3:59
 import { sql } from "./dbConnection.js";
 
-const updateProfileImage = async (email, profileImage) => {
-    if (email === null || email === undefined || email === "") return null;
-    if (profileImage === null || profileImage === undefined || profileImage === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET profileimage=${profileImage} WHERE email=${email} RETURNING id, email, profileimage`;
-        return result;
-    } catch (error) {
-        console.error("Error updating profile image:", error);
-        return null;
-    }
-};
+const updateProfileImage = async (email, profileImage) => {};
 
 export { updateProfileImage };

[Killed] ConditionalExpression
src/db/updateProfileImage.js:4:27
 import { sql } from "./dbConnection.js";
 
 const updateProfileImage = async (email, profileImage) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email === null || false || email === "") return null;
     if (profileImage === null || profileImage === undefined || profileImage === "") return null;
     try {
killedBy: updateProfileImage() should return null & NOT call DB when email is 'undefined'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET profileimage=", " WHERE email=", " RETURNING id, email, profileimage"], "img.png", undefined

[Killed] EqualityOperator
src/db/updateProfileImage.js:4:50
 import { sql } from "./dbConnection.js";
 
 const updateProfileImage = async (email, profileImage) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email === null || email === undefined || email !== "") return null;
     if (profileImage === null || profileImage === undefined || profileImage === "") return null;
     try {
killedBy: updateProfileImage() should update profile image and return DB result for valid email and image
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "user@example.com", "id": 1, "profileimage": "https://cloudinary.com/img123.png"}]
Received: null

[Killed] EqualityOperator
src/db/updateProfileImage.js:5:34
 
 const updateProfileImage = async (email, profileImage) => {
     if (email === null || email === undefined || email === "") return null;
-    if (profileImage === null || profileImage === undefined || profileImage === "") return null;
+    if (profileImage === null || profileImage !== undefined || profileImage === "") return null;
     try {
         const result =
killedBy: updateProfileImage() should update profile image and return DB result for valid email and image
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "user@example.com", "id": 1, "profileimage": "https://cloudinary.com/img123.png"}]
Received: null

[Killed] LogicalOperator
src/db/updateProfileImage.js:5:9
 
 const updateProfileImage = async (email, profileImage) => {
     if (email === null || email === undefined || email === "") return null;
-    if (profileImage === null || profileImage === undefined || profileImage === "") return null;
+    if (profileImage === null && profileImage === undefined || profileImage === "") return null;
     try {
         const result =
killedBy: updateProfileImage() should return null & NOT call DB when profileImage is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET profileimage=", " WHERE email=", " RETURNING id, email, profileimage"], null, "user@example.com"

[Killed] BlockStatement
src/db/updateProfileImage.js:6:9
 const updateProfileImage = async (email, profileImage) => {
     if (email === null || email === undefined || email === "") return null;
     if (profileImage === null || profileImage === undefined || profileImage === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET profileimage=${profileImage} WHERE email=${email} RETURNING id, email, profileimage`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating profile image:", error);
         return null;
killedBy: updateProfileImage() should update profile image and return DB result for valid email and image
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "user@example.com", "id": 1, "profileimage": "https://cloudinary.com/img123.png"}]
Received: undefined

[Killed] BlockStatement
src/db/updateProfileImage.js:10:21
         const result =
             await sql`UPDATE "user" SET profileimage=${profileImage} WHERE email=${email} RETURNING id, email, profileimage`;
         return result;
-    } catch (error) {
-        console.error("Error updating profile image:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: updateProfileImage() should return null when DB throws an error
statusReason: Error: expect(received).toBeNull()

Received: undefined
