[Killed] BlockStatement
src/db/updateProfileInfo.js:3:50
 import { sql } from "./dbConnection.js";
 
-const updateProfileName = async (email, name) => {
-    if (email === null || email === undefined || email === "") return null;
-    if (name === null || name === undefined || name === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET name=${name} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
-        console.error("Error updating profile name:", error);
-        return null;
-    }
-};
+const updateProfileName = async (email, name) => {};
 
 const updateProfileInvestmentExperience = async (
killedBy: Profile Update Methods updateProfileName() should update name for valid email & name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1}]
Received: undefined

[Killed] LogicalOperator
src/db/updateProfileInfo.js:4:9
 import { sql } from "./dbConnection.js";
 
 const updateProfileName = async (email, name) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email === null && email === undefined || email === "") return null;
     if (name === null || name === undefined || name === "") return null;
     try {
killedBy: Profile Update Methods updateProfileName() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET name=", " WHERE email=", " RETURNING id"], "John Doe", null

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:4:9
 import { sql } from "./dbConnection.js";
 
 const updateProfileName = async (email, name) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (false) return null;
     if (name === null || name === undefined || name === "") return null;
     try {
killedBy: Profile Update Methods updateProfileName() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET name=", " WHERE email=", " RETURNING id"], "John Doe", null

[Killed] EqualityOperator
src/db/updateProfileInfo.js:5:26
 
 const updateProfileName = async (email, name) => {
     if (email === null || email === undefined || email === "") return null;
-    if (name === null || name === undefined || name === "") return null;
+    if (name === null || name !== undefined || name === "") return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileName() should update name for valid email & name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1}]
Received: null

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:5:9
 
 const updateProfileName = async (email, name) => {
     if (email === null || email === undefined || email === "") return null;
-    if (name === null || name === undefined || name === "") return null;
+    if (false || name === undefined || name === "") return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileName() should return null & NOT call DB if second parameter is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET name=", " WHERE email=", " RETURNING id"], null, "user@example.com"

[Killed] BlockStatement
src/db/updateProfileInfo.js:6:9
 const updateProfileName = async (email, name) => {
     if (email === null || email === undefined || email === "") return null;
     if (name === null || name === undefined || name === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET name=${name} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating profile name:", error);
         return null;
killedBy: Profile Update Methods updateProfileName() should update name for valid email & name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1}]
Received: undefined

[Killed] BlockStatement
src/db/updateProfileInfo.js:10:21
         const result =
             await sql`UPDATE "user" SET name=${name} WHERE email=${email} RETURNING id`;
         return result;
-    } catch (error) {
-        console.error("Error updating profile name:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: Profile Update Methods updateProfileName() should return null when DB throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Timeout] BlockStatement
src/db/updateProfileInfo.js:19:6
 const updateProfileInvestmentExperience = async (
     email,
     investmentExperience
-) => {
-    if (email === null || email === undefined || email === "") return null;
-    if (investmentExperience === null || investmentExperience === undefined || investmentExperience === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET investmentExperience=${investmentExperience} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
-        console.error("Error updating profile investment experience:", error);
-        return null;
-    }
-};
+) => {};
 
 const updateProfileRiskProfile = async (email, riskProfile) => {

[Killed] LogicalOperator
src/db/updateProfileInfo.js:20:9
     email,
     investmentExperience
 ) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email === null && email === undefined || email === "") return null;
     if (investmentExperience === null || investmentExperience === undefined || investmentExperience === "") return null;
     try {
killedBy: Profile Update Methods updateProfileInvestmentExperience() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET investmentExperience=", " WHERE email=", " RETURNING id"], "Beginner", null

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:20:50
     email,
     investmentExperience
 ) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email === null || email === undefined || false) return null;
     if (investmentExperience === null || investmentExperience === undefined || investmentExperience === "") return null;
     try {
killedBy: Profile Update Methods updateProfileInvestmentExperience() should return null & NOT call DB if email is ''
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET investmentExperience=", " WHERE email=", " RETURNING id"], "Beginner", ""

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:21:9
     investmentExperience
 ) => {
     if (email === null || email === undefined || email === "") return null;
-    if (investmentExperience === null || investmentExperience === undefined || investmentExperience === "") return null;
+    if (false) return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileInvestmentExperience() should return null & NOT call DB if second parameter is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET investmentExperience=", " WHERE email=", " RETURNING id"], null, "user@example.com"

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:21:9
     investmentExperience
 ) => {
     if (email === null || email === undefined || email === "") return null;
-    if (investmentExperience === null || investmentExperience === undefined || investmentExperience === "") return null;
+    if (false || investmentExperience === "") return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileInvestmentExperience() should return null & NOT call DB if second parameter is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET investmentExperience=", " WHERE email=", " RETURNING id"], null, "user@example.com"

[Killed] BlockStatement
src/db/updateProfileInfo.js:22:9
 ) => {
     if (email === null || email === undefined || email === "") return null;
     if (investmentExperience === null || investmentExperience === undefined || investmentExperience === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET investmentExperience=${investmentExperience} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating profile investment experience:", error);
         return null;
killedBy: Profile Update Methods updateProfileInvestmentExperience() should update investment experience for valid args
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 2}]
Received: undefined

[Killed] BlockStatement
src/db/updateProfileInfo.js:26:21
         const result =
             await sql`UPDATE "user" SET investmentExperience=${investmentExperience} WHERE email=${email} RETURNING id`;
         return result;
-    } catch (error) {
-        console.error("Error updating profile investment experience:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: Profile Update Methods updateProfileInvestmentExperience() should return null when DB throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/db/updateProfileInfo.js:32:64
     }
 };
 
-const updateProfileRiskProfile = async (email, riskProfile) => {
-    if (email === null || email === undefined || email === "") return null;
-    if (riskProfile === null || riskProfile === undefined || riskProfile === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET riskProfile=${riskProfile} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
-        console.error("Error updating profile risk profile:", error);
-        return null;
-    }
-};
+const updateProfileRiskProfile = async (email, riskProfile) => {};
 
 const updateProfileFinancialGoals = async (email, financialGoals) => {
killedBy: Profile Update Methods updateProfileRiskProfile() should update risk profile for valid args
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 3}]
Received: undefined

[Killed] EqualityOperator
src/db/updateProfileInfo.js:33:9
 };
 
 const updateProfileRiskProfile = async (email, riskProfile) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email !== null || email === undefined || email === "") return null;
     if (riskProfile === null || riskProfile === undefined || riskProfile === "") return null;
     try {
killedBy: Profile Update Methods updateProfileRiskProfile() should update risk profile for valid args
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 3}]
Received: null

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:33:9
 };
 
 const updateProfileRiskProfile = async (email, riskProfile) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (false) return null;
     if (riskProfile === null || riskProfile === undefined || riskProfile === "") return null;
     try {
killedBy: Profile Update Methods updateProfileRiskProfile() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET riskProfile=", " WHERE email=", " RETURNING id"], "Moderate", null

[Killed] LogicalOperator
src/db/updateProfileInfo.js:34:9
 
 const updateProfileRiskProfile = async (email, riskProfile) => {
     if (email === null || email === undefined || email === "") return null;
-    if (riskProfile === null || riskProfile === undefined || riskProfile === "") return null;
+    if (riskProfile === null && riskProfile === undefined || riskProfile === "") return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileRiskProfile() should return null & NOT call DB if second parameter is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET riskProfile=", " WHERE email=", " RETURNING id"], null, "user@example.com"

[Killed] LogicalOperator
src/db/updateProfileInfo.js:34:9
 
 const updateProfileRiskProfile = async (email, riskProfile) => {
     if (email === null || email === undefined || email === "") return null;
-    if (riskProfile === null || riskProfile === undefined || riskProfile === "") return null;
+    if ((riskProfile === null || riskProfile === undefined) && riskProfile === "") return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileRiskProfile() should return null & NOT call DB if second parameter is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET riskProfile=", " WHERE email=", " RETURNING id"], null, "user@example.com"

[Killed] BlockStatement
src/db/updateProfileInfo.js:35:9
 const updateProfileRiskProfile = async (email, riskProfile) => {
     if (email === null || email === undefined || email === "") return null;
     if (riskProfile === null || riskProfile === undefined || riskProfile === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET riskProfile=${riskProfile} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating profile risk profile:", error);
         return null;
killedBy: Profile Update Methods updateProfileRiskProfile() should update risk profile for valid args
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 3}]
Received: undefined

[Killed] BlockStatement
src/db/updateProfileInfo.js:39:21
         const result =
             await sql`UPDATE "user" SET riskProfile=${riskProfile} WHERE email=${email} RETURNING id`;
         return result;
-    } catch (error) {
-        console.error("Error updating profile risk profile:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: Profile Update Methods updateProfileRiskProfile() should return null when DB throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/db/updateProfileInfo.js:45:70
     }
 };
 
-const updateProfileFinancialGoals = async (email, financialGoals) => {
-    if (email === null || email === undefined || email === "") return null;
-    if (financialGoals === null || financialGoals === undefined || financialGoals === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET financialGoals=${financialGoals} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
-        console.error("Error updating profile financial goals:", error);
-        return null;
-    }
-};
+const updateProfileFinancialGoals = async (email, financialGoals) => {};
 
 const updateProfileInvestmentHorizon = async (email, investmentHorizon) => {
killedBy: Profile Update Methods updateProfileFinancialGoals() should update financial goals for valid args
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 4}]
Received: undefined

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:46:27
 };
 
 const updateProfileFinancialGoals = async (email, financialGoals) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email === null || false || email === "") return null;
     if (financialGoals === null || financialGoals === undefined || financialGoals === "") return null;
     try {
killedBy: Profile Update Methods updateProfileFinancialGoals() should return null & NOT call DB if email is 'undefined'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET financialGoals=", " WHERE email=", " RETURNING id"], "Retirement", undefined

[Killed] LogicalOperator
src/db/updateProfileInfo.js:46:9
 };
 
 const updateProfileFinancialGoals = async (email, financialGoals) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email === null && email === undefined || email === "") return null;
     if (financialGoals === null || financialGoals === undefined || financialGoals === "") return null;
     try {
killedBy: Profile Update Methods updateProfileFinancialGoals() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET financialGoals=", " WHERE email=", " RETURNING id"], "Retirement", null

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:47:36
 
 const updateProfileFinancialGoals = async (email, financialGoals) => {
     if (email === null || email === undefined || email === "") return null;
-    if (financialGoals === null || financialGoals === undefined || financialGoals === "") return null;
+    if (financialGoals === null || false || financialGoals === "") return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileFinancialGoals() should return null & NOT call DB if second parameter is 'undefined'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET financialGoals=", " WHERE email=", " RETURNING id"], undefined, "user@example.com"

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:47:68
 
 const updateProfileFinancialGoals = async (email, financialGoals) => {
     if (email === null || email === undefined || email === "") return null;
-    if (financialGoals === null || financialGoals === undefined || financialGoals === "") return null;
+    if (financialGoals === null || financialGoals === undefined || false) return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileFinancialGoals() should return null & NOT call DB if second parameter is ''
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET financialGoals=", " WHERE email=", " RETURNING id"], "", "user@example.com"

[Killed] BlockStatement
src/db/updateProfileInfo.js:48:9
 const updateProfileFinancialGoals = async (email, financialGoals) => {
     if (email === null || email === undefined || email === "") return null;
     if (financialGoals === null || financialGoals === undefined || financialGoals === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET financialGoals=${financialGoals} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating profile financial goals:", error);
         return null;
killedBy: Profile Update Methods updateProfileFinancialGoals() should update financial goals for valid args
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 4}]
Received: undefined

[Killed] BlockStatement
src/db/updateProfileInfo.js:52:21
         const result =
             await sql`UPDATE "user" SET financialGoals=${financialGoals} WHERE email=${email} RETURNING id`;
         return result;
-    } catch (error) {
-        console.error("Error updating profile financial goals:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: Profile Update Methods updateProfileFinancialGoals() should return null when DB throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/db/updateProfileInfo.js:58:76
     }
 };
 
-const updateProfileInvestmentHorizon = async (email, investmentHorizon) => {
-    if (email === null || email === undefined || email === "") return null;
-    if (investmentHorizon === null || investmentHorizon === undefined || investmentHorizon === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET investmentHorizon=${investmentHorizon} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
-        console.error("Error updating profile investment horizon:", error);
-        return null;
-    }
-};
+const updateProfileInvestmentHorizon = async (email, investmentHorizon) => {};
 
 export {
killedBy: Profile Update Methods updateProfileInvestmentHorizon() should update investment horizon for valid args
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 5}]
Received: undefined

[Killed] LogicalOperator
src/db/updateProfileInfo.js:59:9
 };
 
 const updateProfileInvestmentHorizon = async (email, investmentHorizon) => {
-    if (email === null || email === undefined || email === "") return null;
+    if (email === null && email === undefined || email === "") return null;
     if (investmentHorizon === null || investmentHorizon === undefined || investmentHorizon === "") return null;
     try {
killedBy: Profile Update Methods updateProfileInvestmentHorizon() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET investmentHorizon=", " WHERE email=", " RETURNING id"], "Long Term", null

[Killed] LogicalOperator
src/db/updateProfileInfo.js:59:9
 };
 
 const updateProfileInvestmentHorizon = async (email, investmentHorizon) => {
-    if (email === null || email === undefined || email === "") return null;
+    if ((email === null || email === undefined) && email === "") return null;
     if (investmentHorizon === null || investmentHorizon === undefined || investmentHorizon === "") return null;
     try {
killedBy: Profile Update Methods updateProfileInvestmentHorizon() should return null & NOT call DB if email is 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["UPDATE \"user\" SET investmentHorizon=", " WHERE email=", " RETURNING id"], "Long Term", null

[Killed] ConditionalExpression
src/db/updateProfileInfo.js:60:9
 
 const updateProfileInvestmentHorizon = async (email, investmentHorizon) => {
     if (email === null || email === undefined || email === "") return null;
-    if (investmentHorizon === null || investmentHorizon === undefined || investmentHorizon === "") return null;
+    if (true) return null;
     try {
         const result =
killedBy: Profile Update Methods updateProfileInvestmentHorizon() should update investment horizon for valid args
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 5}]
Received: null

[Timeout] EqualityOperator
src/db/updateProfileInfo.js:60:39
 
 const updateProfileInvestmentHorizon = async (email, investmentHorizon) => {
     if (email === null || email === undefined || email === "") return null;
-    if (investmentHorizon === null || investmentHorizon === undefined || investmentHorizon === "") return null;
+    if (investmentHorizon === null || investmentHorizon !== undefined || investmentHorizon === "") return null;
     try {
         const result =

[Timeout] BlockStatement
src/db/updateProfileInfo.js:61:9
 const updateProfileInvestmentHorizon = async (email, investmentHorizon) => {
     if (email === null || email === undefined || email === "") return null;
     if (investmentHorizon === null || investmentHorizon === undefined || investmentHorizon === "") return null;
-    try {
-        const result =
-            await sql`UPDATE "user" SET investmentHorizon=${investmentHorizon} WHERE email=${email} RETURNING id`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating profile investment horizon:", error);
         return null;

[Timeout] BlockStatement
src/db/updateProfileInfo.js:65:21
         const result =
             await sql`UPDATE "user" SET investmentHorizon=${investmentHorizon} WHERE email=${email} RETURNING id`;
         return result;
-    } catch (error) {
-        console.error("Error updating profile investment horizon:", error);
-        return null;
-    }
+    } catch (error) {}
 };
 
