[Killed] ConditionalExpression
src/db/userTransactions.js:4:49
 import { sql } from "./dbConnection.js";
 
 export const getPortfolioTransactions = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null || email === undefined || false) return null;
     try {
killedBy: getPortfolioTransactions() should return null & NOT call DB for invalid email: ''
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["SELECT s.short_name,s.long_name,ut.transaction_type,ut.quantity,ut.price,ut.transaction_date FROM \"user_transactions\" as ut join \"stocks\" as s on ut.symbol=s.symbol Where ut.email=", ""], ""

[Killed] LogicalOperator
src/db/userTransactions.js:4:8
 import { sql } from "./dbConnection.js";
 
 export const getPortfolioTransactions = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null && email === undefined || email === "") return null;
     try {
killedBy: getPortfolioTransactions() should return null & NOT call DB for invalid email: 'null'
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["SELECT s.short_name,s.long_name,ut.transaction_type,ut.quantity,ut.price,ut.transaction_date FROM \"user_transactions\" as ut join \"stocks\" as s on ut.symbol=s.symbol Where ut.email=", ""], null

[Killed] BlockStatement
src/db/userTransactions.js:8:21
     try {
         return result;
-    } catch (error) {
-        console.error('Database error - getPortfolioTransactions',error);
-        return null;
-    }
+    } catch (error) {}
 };
killedBy: getPortfolioTransactions() should return null when DB throws an error
statusReason: Error: expect(received).toBeNull()

Received: undefined
