[Survived] BooleanLiteral
src/mongoModels/user.model.js:5:44
 
 const logSchema = new mongoose.Schema(
     {
-        os_type: { type: String, required: true },
+        os_type: { type: String, required: false },
         browser_type: { type: String, required: true },
         type: { type: String, required: true },

[Survived] ObjectLiteral
src/mongoModels/user.model.js:5:18
 
 const logSchema = new mongoose.Schema(
     {
-        os_type: { type: String, required: true },
+        os_type: {},
         browser_type: { type: String, required: true },
         type: { type: String, required: true },

[Survived] BooleanLiteral
src/mongoModels/user.model.js:6:49
 const logSchema = new mongoose.Schema(
     {
         os_type: { type: String, required: true },
-        browser_type: { type: String, required: true },
+        browser_type: { type: String, required: false },
         type: { type: String, required: true },
         message: { type: String, required: true },

[Survived] BooleanLiteral
src/mongoModels/user.model.js:7:41
     {
         os_type: { type: String, required: true },
         browser_type: { type: String, required: true },
-        type: { type: String, required: true },
+        type: { type: String, required: false },
         message: { type: String, required: true },
         token: { type: String, required: true },

[Survived] BooleanLiteral
src/mongoModels/user.model.js:8:44
         os_type: { type: String, required: true },
         browser_type: { type: String, required: true },
         type: { type: String, required: true },
-        message: { type: String, required: true },
+        message: { type: String, required: false },
         token: { type: String, required: true },
     },

[Timeout] ObjectLiteral
src/mongoModels/user.model.js:8:18
         os_type: { type: String, required: true },
         browser_type: { type: String, required: true },
         type: { type: String, required: true },
-        message: { type: String, required: true },
+        message: {},
         token: { type: String, required: true },
     },

[Survived] BooleanLiteral
src/mongoModels/user.model.js:9:42
         browser_type: { type: String, required: true },
         type: { type: String, required: true },
         message: { type: String, required: true },
-        token: { type: String, required: true },
+        token: { type: String, required: false },
     },
     { _id: false, timestamps: true }

[Survived] ObjectLiteral
src/mongoModels/user.model.js:9:16
         browser_type: { type: String, required: true },
         type: { type: String, required: true },
         message: { type: String, required: true },
-        token: { type: String, required: true },
+        token: {},
     },
     { _id: false, timestamps: true }

[Survived] BooleanLiteral
src/mongoModels/user.model.js:11:31
         message: { type: String, required: true },
         token: { type: String, required: true },
     },
-    { _id: false, timestamps: true }
+    { _id: false, timestamps: false }
 );
 

[Survived] BooleanLiteral
src/mongoModels/user.model.js:11:12
         message: { type: String, required: true },
         token: { type: String, required: true },
     },
-    { _id: false, timestamps: true }
+    { _id: true, timestamps: true }
 );
 

[Survived] BooleanLiteral
src/mongoModels/user.model.js:15:38
 );
 
 const userSchema = new mongoose.Schema({
-    email: { type: String, required: true, unique: true },
+    email: { type: String, required: false, unique: true },
     securityAlerts: { type: [logSchema], default: [] },
     activityHistory: { type: [logSchema], default: [] },

[Survived] BooleanLiteral
src/mongoModels/user.model.js:15:52
 );
 
 const userSchema = new mongoose.Schema({
-    email: { type: String, required: true, unique: true },
+    email: { type: String, required: true, unique: false },
     securityAlerts: { type: [logSchema], default: [] },
     activityHistory: { type: [logSchema], default: [] },

[Survived] ArrayDeclaration
src/mongoModels/user.model.js:16:51
 
 const userSchema = new mongoose.Schema({
     email: { type: String, required: true, unique: true },
-    securityAlerts: { type: [logSchema], default: [] },
+    securityAlerts: { type: [logSchema], default: ["Stryker was here"] },
     activityHistory: { type: [logSchema], default: [] },
 });

[Survived] ObjectLiteral
src/mongoModels/user.model.js:17:22
 const userSchema = new mongoose.Schema({
     email: { type: String, required: true, unique: true },
     securityAlerts: { type: [logSchema], default: [] },
-    activityHistory: { type: [logSchema], default: [] },
+    activityHistory: {},
 });
 

[Survived] ArrayDeclaration
src/mongoModels/user.model.js:17:52
 const userSchema = new mongoose.Schema({
     email: { type: String, required: true, unique: true },
     securityAlerts: { type: [logSchema], default: [] },
-    activityHistory: { type: [logSchema], default: [] },
+    activityHistory: { type: [logSchema], default: ["Stryker was here"] },
 });
 

[Killed] BlockStatement
src/mongoModels/user.model.js:22:57
 
 export const User = mongoose.model("User", userSchema);
 
-export async function addSecurityAlert(email, newAlert) {
-    if(!email || !newAlert) return
-    try {
-        await User.findOneAndUpdate(
-            { email },
-            {
-                $push: {
-                    securityAlerts: {
-                        $each: [newAlert],
-                        $position: 0,
-                        $slice: 50,
-                    },
-                },
-            },
-            { upsert: true, new: true }
-        );
-    } catch (error) {
-        console.error("error in addSecurityAlert",error);
-    }
-}
+export async function addSecurityAlert(email, newAlert) {}
 
 export async function addActivityHistory(email, newActivity) {
killedBy: User Model Functions addSecurityAlert() should call DB for valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] LogicalOperator
src/mongoModels/user.model.js:23:8
 export const User = mongoose.model("User", userSchema);
 
 export async function addSecurityAlert(email, newAlert) {
-    if(!email || !newAlert) return
+    if(!email && !newAlert) return
     try {
         await User.findOneAndUpdate(
killedBy: User Model Functions addSecurityAlert() should NOT call DB for invalid inputs
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 4

1: {"email": ""}, {"$push": {"securityAlerts": {"$each": [{"token": "abc", "type": "login"}], "$position": 0, "$slice": 50}}}, {"new": true, "upsert": true}
2: {"email": "test@example.com"}, {"$push": {"securityAlerts": {"$each": [""], "$position": 0, "$slice": 50}}}, {"new": true, "upsert": t

[Killed] ConditionalExpression
src/mongoModels/user.model.js:23:8
 export const User = mongoose.model("User", userSchema);
 
 export async function addSecurityAlert(email, newAlert) {
-    if(!email || !newAlert) return
+    if(false) return
     try {
         await User.findOneAndUpdate(
killedBy: User Model Functions addSecurityAlert() should NOT call DB for invalid inputs
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 4

1: {"email": ""}, {"$push": {"securityAlerts": {"$each": [{"token": "abc", "type": "login"}], "$position": 0, "$slice": 50}}}, {"new": true, "upsert": true}
2: {"email": "test@example.com"}, {"$push": {"securityAlerts": {"$each": [""], "$position": 0, "$slice": 50}}}, {"new": true, "upsert": t

[Killed] BlockStatement
src/mongoModels/user.model.js:24:9
 
 export async function addSecurityAlert(email, newAlert) {
     if(!email || !newAlert) return
-    try {
-        await User.findOneAndUpdate(
-            { email },
-            {
-                $push: {
-                    securityAlerts: {
-                        $each: [newAlert],
-                        $position: 0,
-                        $slice: 50,
-                    },
-                },
-            },
-            { upsert: true, new: true }
-        );
-    } catch (error) {
+    try {} catch (error) {
         console.error("error in addSecurityAlert",error);
     }
killedBy: User Model Functions addSecurityAlert() should call DB for valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ObjectLiteral
src/mongoModels/user.model.js:26:13
     if(!email || !newAlert) return
     try {
         await User.findOneAndUpdate(
-            { email },
+            {},
             {
                 $push: {

[Survived] BooleanLiteral
src/mongoModels/user.model.js:36:34
                     },
                 },
             },
-            { upsert: true, new: true }
+            { upsert: true, new: false }
         );
     } catch (error) {

[Survived] BooleanLiteral
src/mongoModels/user.model.js:36:23
                     },
                 },
             },
-            { upsert: true, new: true }
+            { upsert: false, new: true }
         );
     } catch (error) {

[Killed] BlockStatement
src/mongoModels/user.model.js:38:21
             },
             { upsert: true, new: true }
         );
-    } catch (error) {
-        console.error("error in addSecurityAlert",error);
-    }
+    } catch (error) {}
 }
 
killedBy: User Model Functions addSecurityAlert() should log error on DB failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/mongoModels/user.model.js:43:62
     }
 }
 
-export async function addActivityHistory(email, newActivity) {
-    if(!email || !newActivity) return
-    try {
-        await User.findOneAndUpdate(
-            { email },
-            {
-                $push: {
-                    activityHistory: {
-                        $each: [newActivity],
-                        $position: 0,
-                        $slice: 100,
-                    },
-                },
-            },
-            { upsert: true, new: true }
-        );
-    } catch (error) {
-        console.error("error in addActivityHistory",error);
-    }
-}
+export async function addActivityHistory(email, newActivity) {}
 
 export async function getRecentSecurityAlerts(email) {
killedBy: User Model Functions addActivityHistory() should call DB for valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/mongoModels/user.model.js:44:18
 }
 
 export async function addActivityHistory(email, newActivity) {
-    if(!email || !newActivity) return
+    if(!email || newActivity) return
     try {
         await User.findOneAndUpdate(
killedBy: User Model Functions addActivityHistory() should call DB for valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/mongoModels/user.model.js:44:8
 }
 
 export async function addActivityHistory(email, newActivity) {
-    if(!email || !newActivity) return
+    if(email || !newActivity) return
     try {
         await User.findOneAndUpdate(
killedBy: User Model Functions addActivityHistory() should call DB for valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/mongoModels/user.model.js:45:9
 
 export async function addActivityHistory(email, newActivity) {
     if(!email || !newActivity) return
-    try {
-        await User.findOneAndUpdate(
-            { email },
-            {
-                $push: {
-                    activityHistory: {
-                        $each: [newActivity],
-                        $position: 0,
-                        $slice: 100,
-                    },
-                },
-            },
-            { upsert: true, new: true }
-        );
-    } catch (error) {
+    try {} catch (error) {
         console.error("error in addActivityHistory",error);
     }
killedBy: User Model Functions addActivityHistory() should call DB for valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ObjectLiteral
src/mongoModels/user.model.js:48:13
     try {
         await User.findOneAndUpdate(
             { email },
-            {
-                $push: {
-                    activityHistory: {
-                        $each: [newActivity],
-                        $position: 0,
-                        $slice: 100,
-                    },
-                },
-            },
+            {},
             { upsert: true, new: true }
         );

[Survived] ArrayDeclaration
src/mongoModels/user.model.js:51:32
             {
                 $push: {
                     activityHistory: {
-                        $each: [newActivity],
+                        $each: [],
                         $position: 0,
                         $slice: 100,

[Killed] BlockStatement
src/mongoModels/user.model.js:59:21
             },
             { upsert: true, new: true }
         );
-    } catch (error) {
-        console.error("error in addActivityHistory",error);
-    }
+    } catch (error) {}
 }
 
killedBy: User Model Functions addActivityHistory() should log error on DB failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/mongoModels/user.model.js:64:54
     }
 }
 
-export async function getRecentSecurityAlerts(email) {
-    if(!email) return
-    let user = null;
-    try {
-        user = await User.findOne({ email }, { securityAlerts: { $slice: 3 } });
-    } catch (error) {
-        console.error("error in getRecentSecurityAlerts",error);
-        throw error;
-    }
-    return user?.securityAlerts || [];
-}
+export async function getRecentSecurityAlerts(email) {}
 
 export async function getRecentActivityHistory(email) {
killedBy: User Model Functions getRecentSecurityAlerts() should return sliced alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: undefined

[Killed] BooleanLiteral
src/mongoModels/user.model.js:65:8
 }
 
 export async function getRecentSecurityAlerts(email) {
-    if(!email) return
+    if(email) return
     let user = null;
     try {
killedBy: User Model Functions getRecentSecurityAlerts() should return sliced alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:65:8
 }
 
 export async function getRecentSecurityAlerts(email) {
-    if(!email) return
+    if(true) return
     let user = null;
     try {
killedBy: User Model Functions getRecentSecurityAlerts() should return sliced alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: undefined

[Killed] BlockStatement
src/mongoModels/user.model.js:67:9
 export async function getRecentSecurityAlerts(email) {
     if(!email) return
     let user = null;
-    try {
-        user = await User.findOne({ email }, { securityAlerts: { $slice: 3 } });
-    } catch (error) {
+    try {} catch (error) {
         console.error("error in getRecentSecurityAlerts",error);
         throw error;
killedBy: User Model Functions getRecentSecurityAlerts() should return sliced alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] BlockStatement
src/mongoModels/user.model.js:69:21
     let user = null;
     try {
         user = await User.findOne({ email }, { securityAlerts: { $slice: 3 } });
-    } catch (error) {
-        console.error("error in getRecentSecurityAlerts",error);
-        throw error;
-    }
+    } catch (error) {}
     return user?.securityAlerts || [];
 }
killedBy: User Model Functions getRecentSecurityAlerts() should throw on error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: []

[Killed] ConditionalExpression
src/mongoModels/user.model.js:73:12
         console.error("error in getRecentSecurityAlerts",error);
         throw error;
     }
-    return user?.securityAlerts || [];
+    return true;
 }
 
killedBy: User Model Functions getRecentSecurityAlerts() should return sliced alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: true

[Killed] LogicalOperator
src/mongoModels/user.model.js:73:12
         console.error("error in getRecentSecurityAlerts",error);
         throw error;
     }
-    return user?.securityAlerts || [];
+    return user?.securityAlerts && [];
 }
 
killedBy: User Model Functions getRecentSecurityAlerts() should return sliced alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] BlockStatement
src/mongoModels/user.model.js:76:55
     return user?.securityAlerts || [];
 }
 
-export async function getRecentActivityHistory(email) {
-    if(!email) return
-    let user = null;
-    try {
-        user = await User.findOne(
-            { email },
-            { activityHistory: { $slice: 4 } }
-        );
-    } catch (error) {
-        console.error("error in getRecentActivityHistory",error);
-        throw error;
-    }
-    return user?.activityHistory || [];
-}
+export async function getRecentActivityHistory(email) {}
 
 export async function getAllSecurityAlerts(email) {
killedBy: User Model Functions getRecentActivityHistory() should return sliced history
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: undefined

[Killed] BooleanLiteral
src/mongoModels/user.model.js:77:8
 }
 
 export async function getRecentActivityHistory(email) {
-    if(!email) return
+    if(email) return
     let user = null;
     try {
killedBy: User Model Functions getRecentActivityHistory() should return sliced history
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:77:8
 }
 
 export async function getRecentActivityHistory(email) {
-    if(!email) return
+    if(false) return
     let user = null;
     try {
killedBy: User Model Functions getRecentActivityHistory() should NOT call DB for invalid email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"email": ""}, {"activityHistory": {"$slice": 4}}

[Killed] BlockStatement
src/mongoModels/user.model.js:79:9
 export async function getRecentActivityHistory(email) {
     if(!email) return
     let user = null;
-    try {
-        user = await User.findOne(
-            { email },
-            { activityHistory: { $slice: 4 } }
-        );
-    } catch (error) {
+    try {} catch (error) {
         console.error("error in getRecentActivityHistory",error);
         throw error;
killedBy: User Model Functions getRecentActivityHistory() should return sliced history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   1,
-   2,

[Survived] ObjectLiteral
src/mongoModels/user.model.js:82:13
     try {
         user = await User.findOne(
             { email },
-            { activityHistory: { $slice: 4 } }
+            {}
         );
     } catch (error) {

[Killed] BlockStatement
src/mongoModels/user.model.js:84:21
             { email },
             { activityHistory: { $slice: 4 } }
         );
-    } catch (error) {
-        console.error("error in getRecentActivityHistory",error);
-        throw error;
-    }
+    } catch (error) {}
     return user?.activityHistory || [];
 }
killedBy: User Model Functions getRecentActivityHistory() should throw on DB error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: []

[Killed] ConditionalExpression
src/mongoModels/user.model.js:88:12
         console.error("error in getRecentActivityHistory",error);
         throw error;
     }
-    return user?.activityHistory || [];
+    return true;
 }
 
killedBy: User Model Functions getRecentActivityHistory() should return sliced history
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: true

[Killed] OptionalChaining
src/mongoModels/user.model.js:88:12
         console.error("error in getRecentActivityHistory",error);
         throw error;
     }
-    return user?.activityHistory || [];
+    return user.activityHistory || [];
 }
 
killedBy: User Model Functions getRecentActivityHistory() should return empty array if no history
statusReason: TypeError: Cannot read properties of null (reading 'activityHistory')

[Killed] BlockStatement
src/mongoModels/user.model.js:91:51
     return user?.activityHistory || [];
 }
 
-export async function getAllSecurityAlerts(email) {
-    if(!email) return
-    let user = null;
-    try {
-        user = await User.findOne({ email }, { securityAlerts: 1, _id: 0 });
-    } catch (error) {
-        console.error("error in getAllSecurityAlerts",error);
-        throw error;
-    }
-    return user?.securityAlerts || [];
-}
+export async function getAllSecurityAlerts(email) {}
 
 export async function getAllActivityHistory(email) {
killedBy: User Model Functions getAllSecurityAlerts() should return all alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2]
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:92:8
 }
 
 export async function getAllSecurityAlerts(email) {
-    if(!email) return
+    if(false) return
     let user = null;
     try {
killedBy: User Model Functions getAllSecurityAlerts() should NOT call DB for invalid email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"email": ""}, {"_id": 0, "securityAlerts": 1}

[Killed] ConditionalExpression
src/mongoModels/user.model.js:92:8
 }
 
 export async function getAllSecurityAlerts(email) {
-    if(!email) return
+    if(true) return
     let user = null;
     try {
killedBy: User Model Functions getAllSecurityAlerts() should return all alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2]
Received: undefined

[Killed] BlockStatement
src/mongoModels/user.model.js:94:9
 export async function getAllSecurityAlerts(email) {
     if(!email) return
     let user = null;
-    try {
-        user = await User.findOne({ email }, { securityAlerts: 1, _id: 0 });
-    } catch (error) {
+    try {} catch (error) {
         console.error("error in getAllSecurityAlerts",error);
         throw error;
killedBy: User Model Functions getAllSecurityAlerts() should return all alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] BlockStatement
src/mongoModels/user.model.js:96:21
     let user = null;
     try {
         user = await User.findOne({ email }, { securityAlerts: 1, _id: 0 });
-    } catch (error) {
-        console.error("error in getAllSecurityAlerts",error);
-        throw error;
-    }
+    } catch (error) {}
     return user?.securityAlerts || [];
 }
killedBy: User Model Functions getAllSecurityAlerts() should throw on error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: []

[Killed] ConditionalExpression
src/mongoModels/user.model.js:100:12
         console.error("error in getAllSecurityAlerts",error);
         throw error;
     }
-    return user?.securityAlerts || [];
+    return false;
 }
 
killedBy: User Model Functions getAllSecurityAlerts() should return all alerts
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2]
Received: false

[Killed] BlockStatement
src/mongoModels/user.model.js:103:52
     return user?.securityAlerts || [];
 }
 
-export async function getAllActivityHistory(email) {
-    if(!email) return
-    let user;
-    try {
-        user = await User.findOne({ email }, { activityHistory: 1, _id: 0 });
-    } catch (error) {
-        console.error("error in getAllActivityHistory",error);
-        throw error;
-    }
-    return user?.activityHistory || [];
-}
+export async function getAllActivityHistory(email) {}
 
 export async function getSecurityAlertsByToken(token) {
killedBy: User Model Functions getAllActivityHistory() should return history
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:104:8
 }
 
 export async function getAllActivityHistory(email) {
-    if(!email) return
+    if(false) return
     let user;
     try {
killedBy: User Model Functions getAllActivityHistory() should NOT call DB for invalid email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"email": ""}, {"_id": 0, "activityHistory": 1}

[Killed] BooleanLiteral
src/mongoModels/user.model.js:104:8
 }
 
 export async function getAllActivityHistory(email) {
-    if(!email) return
+    if(email) return
     let user;
     try {
killedBy: User Model Functions getAllActivityHistory() should return history
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] BlockStatement
src/mongoModels/user.model.js:106:9
 export async function getAllActivityHistory(email) {
     if(!email) return
     let user;
-    try {
-        user = await User.findOne({ email }, { activityHistory: 1, _id: 0 });
-    } catch (error) {
+    try {} catch (error) {
         console.error("error in getAllActivityHistory",error);
         throw error;
killedBy: User Model Functions getAllActivityHistory() should return history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Survived] ObjectLiteral
src/mongoModels/user.model.js:107:46
     if(!email) return
     let user;
     try {
-        user = await User.findOne({ email }, { activityHistory: 1, _id: 0 });
+        user = await User.findOne({ email }, {});
     } catch (error) {
         console.error("error in getAllActivityHistory",error);

[Killed] BlockStatement
src/mongoModels/user.model.js:108:21
     let user;
     try {
         user = await User.findOne({ email }, { activityHistory: 1, _id: 0 });
-    } catch (error) {
-        console.error("error in getAllActivityHistory",error);
-        throw error;
-    }
+    } catch (error) {}
     return user?.activityHistory || [];
 }
killedBy: User Model Functions getAllActivityHistory() should throw on error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: []

[Killed] LogicalOperator
src/mongoModels/user.model.js:112:12
         console.error("error in getAllActivityHistory",error);
         throw error;
     }
-    return user?.activityHistory || [];
+    return user?.activityHistory && [];
 }
 
killedBy: User Model Functions getAllActivityHistory() should return history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] BlockStatement
src/mongoModels/user.model.js:115:55
     return user?.activityHistory || [];
 }
 
-export async function getSecurityAlertsByToken(token) {
-    if(!token) return
-    let result;
-    try {
-        result = await User.aggregate([
-            { $unwind: "$securityAlerts" },
-            { $match: { "securityAlerts.token": token } },
-            { $replaceRoot: { newRoot: "$securityAlerts" } },
-        ]);
-    } catch (error) {
-        console.error("error in getSecurityAlertsByToken",error);
-        throw error;
-    }
-    return result;
-}
+export async function getSecurityAlertsByToken(token) {}
 
 export async function getActivityHistoryByToken(token) {
killedBy: User Model Functions getSecurityAlertsByToken() should return aggregated results
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2]
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:116:8
 }
 
 export async function getSecurityAlertsByToken(token) {
-    if(!token) return
+    if(true) return
     let result;
     try {
killedBy: User Model Functions getSecurityAlertsByToken() should return aggregated results
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2]
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:116:8
 }
 
 export async function getSecurityAlertsByToken(token) {
-    if(!token) return
+    if(false) return
     let result;
     try {
killedBy: User Model Functions getSecurityAlertsByToken() should NOT call DB for invalid token
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [{"$unwind": "$securityAlerts"}, {"$match": {"securityAlerts.token": ""}}, {"$replaceRoot": {"newRoot": "$securityAlerts"}}]
