[Killed] BlockStatement
src/mongoModels/user.model.js:118:9
 export async function getSecurityAlertsByToken(token) {
     if(!token) return
     let result;
-    try {
-        result = await User.aggregate([
-            { $unwind: "$securityAlerts" },
-            { $match: { "securityAlerts.token": token } },
-            { $replaceRoot: { newRoot: "$securityAlerts" } },
-        ]);
-    } catch (error) {
+    try {} catch (error) {
         console.error("error in getSecurityAlertsByToken",error);
         throw error;
killedBy: User Model Functions getSecurityAlertsByToken() should return aggregated results
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2]
Received: undefined

[Survived] ArrayDeclaration
src/mongoModels/user.model.js:119:39
     if(!token) return
     let result;
     try {
-        result = await User.aggregate([
-            { $unwind: "$securityAlerts" },
-            { $match: { "securityAlerts.token": token } },
-            { $replaceRoot: { newRoot: "$securityAlerts" } },
-        ]);
+        result = await User.aggregate([]);
     } catch (error) {
         console.error("error in getSecurityAlertsByToken",error);

[Survived] ObjectLiteral
src/mongoModels/user.model.js:121:13
     try {
         result = await User.aggregate([
             { $unwind: "$securityAlerts" },
-            { $match: { "securityAlerts.token": token } },
+            {},
             { $replaceRoot: { newRoot: "$securityAlerts" } },
         ]);

[Killed] BlockStatement
src/mongoModels/user.model.js:124:21
             { $match: { "securityAlerts.token": token } },
             { $replaceRoot: { newRoot: "$securityAlerts" } },
         ]);
-    } catch (error) {
-        console.error("error in getSecurityAlertsByToken",error);
-        throw error;
-    }
+    } catch (error) {}
     return result;
 }
killedBy: User Model Functions getSecurityAlertsByToken() should throw on DB error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/mongoModels/user.model.js:131:56
     return result;
 }
 
-export async function getActivityHistoryByToken(token) {
-    if(!token) return
-    let result;
-    try {
-        result = await User.aggregate([
-            { $unwind: "$activityHistory" },
-            { $match: { "activityHistory.token": token } },
-            { $replaceRoot: { newRoot: "$activityHistory" } },
-        ]);
-    } catch (error) {
-        console.error("error in getActivityHistoryByToken",error);
-        throw error;
-    }
-    return result;
-}
+export async function getActivityHistoryByToken(token) {}
 
 export async function deleteSecurityAlertsByEmail(email) {
killedBy: User Model Functions getActivityHistoryByToken() should return results
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:132:8
 }
 
 export async function getActivityHistoryByToken(token) {
-    if(!token) return
+    if(true) return
     let result;
     try {
killedBy: User Model Functions getActivityHistoryByToken() should return results
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] BooleanLiteral
src/mongoModels/user.model.js:132:8
 }
 
 export async function getActivityHistoryByToken(token) {
-    if(!token) return
+    if(token) return
     let result;
     try {
killedBy: User Model Functions getActivityHistoryByToken() should return results
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] BlockStatement
src/mongoModels/user.model.js:134:9
 export async function getActivityHistoryByToken(token) {
     if(!token) return
     let result;
-    try {
-        result = await User.aggregate([
-            { $unwind: "$activityHistory" },
-            { $match: { "activityHistory.token": token } },
-            { $replaceRoot: { newRoot: "$activityHistory" } },
-        ]);
-    } catch (error) {
+    try {} catch (error) {
         console.error("error in getActivityHistoryByToken",error);
         throw error;
killedBy: User Model Functions getActivityHistoryByToken() should return results
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Survived] ArrayDeclaration
src/mongoModels/user.model.js:135:39
     if(!token) return
     let result;
     try {
-        result = await User.aggregate([
-            { $unwind: "$activityHistory" },
-            { $match: { "activityHistory.token": token } },
-            { $replaceRoot: { newRoot: "$activityHistory" } },
-        ]);
+        result = await User.aggregate([]);
     } catch (error) {
         console.error("error in getActivityHistoryByToken",error);

[Killed] BlockStatement
src/mongoModels/user.model.js:140:21
             { $match: { "activityHistory.token": token } },
             { $replaceRoot: { newRoot: "$activityHistory" } },
         ]);
-    } catch (error) {
-        console.error("error in getActivityHistoryByToken",error);
-        throw error;
-    }
+    } catch (error) {}
     return result;
 }
killedBy: User Model Functions getActivityHistoryByToken() should throw on DB error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/mongoModels/user.model.js:147:58
     return result;
 }
 
-export async function deleteSecurityAlertsByEmail(email) {
-    if(!email) return
-    try {
-        return await User.updateOne(
-            { email },
-            { $set: { securityAlerts: [] } }
-        );
-    } catch (error) {
-        console.error(`error in deleting security alerts of ${email}`, error);
-    }
-}
+export async function deleteSecurityAlertsByEmail(email) {}
 
 export async function deleteActivityHistoryByEmail(email) {
killedBy: User Model Functions deleteSecurityAlertsByEmail() should call updateOne for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"acknowledged": true}
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:148:8
 }
 
 export async function deleteSecurityAlertsByEmail(email) {
-    if(!email) return
+    if(false) return
     try {
         return await User.updateOne(
killedBy: User Model Functions deleteSecurityAlertsByEmail() should NOT call DB for invalid email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"email": ""}, {"$set": {"securityAlerts": []}}

[Killed] BooleanLiteral
src/mongoModels/user.model.js:148:8
 }
 
 export async function deleteSecurityAlertsByEmail(email) {
-    if(!email) return
+    if(email) return
     try {
         return await User.updateOne(
killedBy: User Model Functions deleteSecurityAlertsByEmail() should call updateOne for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"acknowledged": true}
Received: undefined

[Killed] BlockStatement
src/mongoModels/user.model.js:149:9
 
 export async function deleteSecurityAlertsByEmail(email) {
     if(!email) return
-    try {
-        return await User.updateOne(
-            { email },
-            { $set: { securityAlerts: [] } }
-        );
-    } catch (error) {
+    try {} catch (error) {
         console.error(`error in deleting security alerts of ${email}`, error);
     }
killedBy: User Model Functions deleteSecurityAlertsByEmail() should call updateOne for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"acknowledged": true}
Received: undefined

[Killed] BlockStatement
src/mongoModels/user.model.js:154:21
             { email },
             { $set: { securityAlerts: [] } }
         );
-    } catch (error) {
-        console.error(`error in deleting security alerts of ${email}`, error);
-    }
+    } catch (error) {}
 }
 
killedBy: User Model Functions deleteSecurityAlertsByEmail() should log error for DB failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/mongoModels/user.model.js:159:59
     }
 }
 
-export async function deleteActivityHistoryByEmail(email) {
-    if(!email) return
-    try {
-        return await User.updateOne(
-            { email },
-            { $set: { activityHistory: [] } }
-        );
-    } catch (error) {
-        console.error(`error in deleting activity history of ${email}`, error);
-    }
-}
+export async function deleteActivityHistoryByEmail(email) {}
 
killedBy: User Model Functions deleteActivityHistoryByEmail() should call updateOne for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"acknowledged": true}
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:160:8
 }
 
 export async function deleteActivityHistoryByEmail(email) {
-    if(!email) return
+    if(true) return
     try {
         return await User.updateOne(
killedBy: User Model Functions deleteActivityHistoryByEmail() should call updateOne for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"acknowledged": true}
Received: undefined

[Killed] ConditionalExpression
src/mongoModels/user.model.js:160:8
 }
 
 export async function deleteActivityHistoryByEmail(email) {
-    if(!email) return
+    if(false) return
     try {
         return await User.updateOne(
killedBy: User Model Functions deleteActivityHistoryByEmail() should NOT call DB for invalid email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"email": ""}, {"$set": {"activityHistory": []}}

[Killed] BlockStatement
src/mongoModels/user.model.js:161:9
 
 export async function deleteActivityHistoryByEmail(email) {
     if(!email) return
-    try {
-        return await User.updateOne(
-            { email },
-            { $set: { activityHistory: [] } }
-        );
-    } catch (error) {
+    try {} catch (error) {
         console.error(`error in deleting activity history of ${email}`, error);
     }
killedBy: User Model Functions deleteActivityHistoryByEmail() should call updateOne for valid email
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"acknowledged": true}
Received: undefined

[Survived] ObjectLiteral
src/mongoModels/user.model.js:163:13
     if(!email) return
     try {
         return await User.updateOne(
-            { email },
+            {},
             { $set: { activityHistory: [] } }
         );

[Killed] BlockStatement
src/mongoModels/user.model.js:166:21
             { email },
             { $set: { activityHistory: [] } }
         );
-    } catch (error) {
-        console.error(`error in deleting activity history of ${email}`, error);
-    }
+    } catch (error) {}
 }
 
killedBy: User Model Functions deleteActivityHistoryByEmail() should log error on DB failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
