[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:91:7
 };
 
 function formatNumber(value) {
-  if (!value || typeof value !== "number" || Number.isNaN(value)) return "-";
+  if (false || Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
killedBy: getSummaryTable Controller should cover all formatNumber branches
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1
